[[["Erielle Sudario", "", 0.9, "Nintendo knows what's great about the 'Super Mario Bros.' games, and perfectly brings them to life on the big screen. Read full review"], ["Ross Bonaime", "", 0.83, "The Super Mario Bros. Movie captures the spirit of the games, the deep history, and the incredible possibilities that these games have presented for decades, all in one of the most fun animated films in years, with a team behind it that you can feel loves these characters and this world. Read full review"], ["Tom Jorgensen", "", 0.8, "The Super Mario Bros. Movie is a fireball of animated fantasy. Mario, Luigi, and Peach’s adventure delights with its infectious energy and smart implementations of video game callbacks, and the top-shelf animation renders the Mushroom Kingdom as an Oz-like wonderland that begs to be explored in the inevitable sequels that will follow. Read full review"], ["Christian Zilko", "", 0.75, "The Super Mario Bros. Movie is a true masterclass in exploiting juicy IP, building out an intricate-yet-familiar world that’s littered with video game Easter eggs that could set up other movies. Read full review"], ["Matthew Huff", "", 0.75, "Ultimately, Nintendo fans are sure to find the second Mario film (unlike the first) well worth a trip to the cinema, and with a runtime of only 92 minutes, it doesn’t overstay its welcome. But to swipe a metaphor from the original NES Super Mario Bros. game, while the film may complete the level, it doesn’t quite nail the leap to the top of the flagpole. Read full review"], ["Richard Roeper", "", 0.75, "With an ending clearly setting up further adventures to come, The Super Mario Bros. is a solid kickoff to a new chapter in this enduring, multi-platform franchise Read full review"], ["Liz Shannon Miller", "", 0.75, "For any parents reading this — it might not be the best film of the year, but you're going to be able to watch The Super Mario Bros. Movie more than once without losing your dang mind. Read full review"], ["Lex Briscuso", "", 0.73, "Short of dropping onto the Rainbow Road ourselves there is no experience closer to being fully immersed in one of the world’s most beloved video games. Pair that with some great comedic moments and swoon-worthy visuals and it looks like The Super Mario Bros. Movie might just make a real mark on the feature animation world. Read full review"], ["Kimi Robinson", "", 0.7, "The Super Mario Bros. is family-friendly movie theater catnip over the Easter weekend, and it’s sure to be an enjoyable watch for the average viewer. I’ll leave the “Mario” superfans to determine if every frame, line of dialogue and reference to the video games lives up to the hype around the film. Read full review"], ["Christopher Cruz", "", 0.7, "As Nintendo’s first serious attempt at conquering filmmaking, it’s a lovingly crafted entry point with the potential for more. Read full review"], ["Owen Gleiberman", "", 0.7, "The Super Mario Bros. Movie gives you a wholesome prankish druggy chameleonic video-game buzz; it’s also a nice, sweet confection for 6-year-olds. Read full review"], ["Frank Scheck", "", 0.7, "Directors Aaron Horvath and Michael Jelenic, creators of the Teen Titans Go! series, deliver a reasonably faithful big screen adaptation that, while it features plenty of juvenile humor, wisely doesn’t lean toward broad satire. Read full review"], ["Christian Holub", "", 0.67, "It's all quite fun, with a good sense of humor and a consistent computer-animated aesthetic — plus, at 90 minutes including credits, it's short, sweet, and over before anything can get annoying. Read full review"], ["James Berardinelli", "", 0.63, "By sticking so close to the look and feel of the source material, The Super Mario Bros Movie comes across as something more desirous of being played than watched. I could see this adventure being great fun if approached with game controller in hand. Sitting in a movie theater, however, I found myself wanting more, as if I was only getting part of the experience. Read full review"], ["Pat Padua", "", 0.63, "The artistry is enough to keep children and adults watching. It may help that Mario gains power by eating mushrooms — a good message about healthy eating, on the one hand, yet one with an obvious psychedelic resonance at the same time. Read full review"], ["Jake Coyle", "", 0.63, "None of this is likely to be enough for anyone to exclaim “Oh, yeah!” while hopping up and down and doffing their cap. But it is an hour and a half’s worth of superlative marketing that will whet your appetite for more Mario back home on the couch. Read full review"], ["Peter Travers", "", 0.6, "This lively computer-animated take on the video game just opened and it’s already the biggest box-office smash of 2023. Despite lapses into dull and disposable, it’s also a gift for parents seeking family entertainment for the 5-year-old in all of us. Game on. Read full review"], ["Alex Abad-Santos", "", 0.6, "What you see — the bright, beautiful sweetness of it all — is what you get. Just like the video game. And it doesn’t yearn to be much more than that. Read full review"], ["Phil de Semlyen", "", 0.6, "Candy-coloured fun for greying gamers and fresh-faced wee’uns that does the basics well but not much more. Read full review"], ["Tara Brady", "", 0.6, "It is unfortunate that two directors and a screenwriter (Matthew Fogel) felt the need to shoehorn in an extended family and – groan – Oedipal crisis for both Mario and Donkey Kong. Despite this misstep, the film belts along with an assault of candy colours and a commendable command of canonical detail. Read full review"], ["Joshua Rivera", "", 0.6, "This new take on Mario is so faithful in its efforts to recreate iconography from four decades of video games that there’s almost no energy left to expend on reaching the unconverted. The Super Mario Bros. Movie is a sermon for the Nintendo faithful, their children, and few others. Read full review"], ["Fay Watson", "", 0.6, "While it could use a few banana peels to slow its relentless pace, this adaptation is a faithful introduction to the Mushroom Kingdom. Read full review"], ["Molly Freeman", "", 0.6, "The Super Mario Bros. Movie is chock-full of Nintendo Easter eggs—to the detriment of the story and its characters, which lack any real substance. Read full review"], ["Jesse Hassenger", "", 0.58, "Really, this is a diverting kiddie movie that struggles most visibly when attempting to graft some kind of moral sensibility onto a story that – spoiler alert? – gets resolved by the good guys hitting the bad guys really hard. Read full review"], ["Katie Walsh", "", 0.5, "Fortunately, this loud, hectic movie doesn’t overstay its welcome, but it wouldn’t have the material to last a second longer. It’s bright, busy, inoffensive and exactly the opposite of the weird, dark, edgy 1993 movie adaptation. That may be better for the business of Mario, but it’s not exactly terribly interesting either. Read full review"], ["Dylan Roth", "", 0.5, "For the Mario fan in your household, young or old, it’s likely exactly what they want it to be. However, if you’ve somehow managed to go through life without having any attachment to the character, there is absolutely no reason for you to watch it. Read full review"], ["Eli Friedberg", "", 0.5, "The Super Mario Bros. Movie isn’t an actively unpleasant way to spend an afternoon, but the glib literalism with which it applies cinematic narrative to video games’ abstractions can’t hold a candle to the wrenching pathos and self-discovery of a night on the track with real-life loved ones and Mario in his original medium. Read full review"], ["David Sims", "", 0.5, "The intellectual property has become intimidating, too profitable to warrant risk-taking—so instead, audiences are served an appetizing confection. But kids do love candy, and I’m sure that around the world, they’ll have just one command for their ticket-buying parents: “Let’s-a go!” Read full review"], ["Katie Walsh", "", 0.5, "The Super Mario Bros. Movie is mildly amusing, swift, noisy and unrelentingly paced, which is par for the course considering this is the studio that brought us the Minions. Read full review"], ["Tim Grierson", "", 0.5, "Whether it’s the hit-or-miss jokes or the familiar action beats, the film too often plays down to its young audience, valuing rambunctious energy over wit or heart. Read full review"], ["Marshall Shaffer", "", 0.5, "The film is in fact so busy introducing characters and churning through plot points that there’s not really even time to let animation powerhouse Illumination give it a spin of inspired silliness that made the “Despicable Me” franchise such an unexpected hit. Read full review"], ["Nick Levine", "", 0.4, "As The Super Mario Bros. Movie progresses, it’s hobbled by a perfunctory plot and some lazy creative choices. Read full review"], ["Michael Leader", "", 0.4, "Since the 1980s, Nintendo has built its reputation on gleeful, ingenious entertainment that delights in design. Conversely, The Super Mario Bros. Movie is empty-calorie, time-filling amusement for the school holidays. In other words, a licence to print money. Read full review"], ["Matt Singer", "", 0.4, "For a couple minutes, it starts to feel like the film is building on top of the Super Mario mythology rather than simply regurgitating it. The rest reminded me of the attract mode that would automatically start to play on old arcade games if no one pressed start: A bunch of computerized images going through the motions over and over. Read full review"], ["Josh Spiegel", "", 0.4, "The Super Mario Bros. Movie brings together the many recognizable characters of the franchise, the musical flourishes, the colorful design, and even some replication of familiar gameplay, into a brisk 90-minute package that is as critic-proof as it is largely uninspiring. Read full review"], ["Clarisse Loughrey", "", 0.4, "It’s hard to demand all that much from a Mario Bros film when its source material has been historically devoid of plot, but shouldn’t we be allowed to demand a little more than mere competency? Read full review"], ["Nicholas Barber", "", 0.4, "The film-makers are obviously so sure that they have a can't-fail franchise on their hands that they haven't even bothered with world-building. Read full review"], ["John Nugent", "", 0.4, "Beautifully animated, and about as faithful and affectionate as a corporate cash-in is possible to get — but it still doesn’t come close to the experience of actually playing the games. Read full review"], ["Peter Bradshaw", "", 0.4, "The second film adaptation of the phenomenally successful video game is a disappointment to rival the first. Read full review"], ["Brian Tallerico", "", 0.38, "The latest animated blockbuster from Illumination is their most soulless to date, a film that feels like ChatGPT produced it after data and imagery from the games were fed into a computer. Read full review"], ["Odie Henderson", "", 0.38, "The best I can say for The Super Mario Bros. Movie is that it’s infinitely better than its predecessor. But you don’t need a power-up to clear that bar. Read full review"], ["Soren Andersen", "", 0.38, "Although the sense of being inside a video game is strong, one critical element is lacking: interactivity. Players are always working their controllers to send characters on their complicated journeys. They’re participants. A movie, by its very nature, turns everyone into spectators. We watch, but have no control over what we see. And what we see in “The Super Mario Bros. Movie” is nothing more than empty-calorie visuals. Read full review"], ["Paul Attard", "", 0.38, "The film feels like it’s content to check off to-do notes and scratch the viewer’s nostalgia itch. Read full review"], ["Alison Willmore", "", 0.3, "The Super Mario Bros. Movie, an almost impressively generic kiddie movie re-skinned with characters and concepts from one of the most famous video game franchises in the world, might as well have been assembled by a focus group. Read full review"], ["Calum Marsh", "", 0.3, "While the details are meticulous, the attitude is all wrong, trading the simple, unaffected charm that has served the character so well since his introduction in 1981 for a snarky and fatuous air that leans hard on winking humor and bland, hackneyed irony. Read full review"], ["Johnny Oleksinski", "", 0.25, "For all its detailed worlds, like the Mushroom Kingdom and Jungle Kingdom, the Nintendo film is just another soulless ploy to sell us merchandise that doesn’t bother to disguise its creativity-starved greed. Mostly the movie comes off like a video game we’re unable to play. Read full review"], ["Zaki Hasan", "", 0.25, "Occasionally amusing but rarely engaging, it leaves one feeling like they’re standing to the side and watching someone else play a video game. Read full review"], ["Chris Knight", "", 0.25, "As is often the case with a not-so-great film, I can report that I wanted to like it more than I did. But I just couldn’t. Read full review"], ["Roger Moore", "", 0.25, "The few laughs kind of die of loneliness, in what is allegedly a children’s animated comedy. And without laughs, all this ill-conceived animated replacement for one of the most infamous live-action flops of the ’90s has to offer is nostalgia for a simple game of a simpler time. The eight-and-unders this is aimed at are way too young to get that. Read full review"], ["Wendy Ide", "", 0.2, "The Super Mario Bros Movie is a frantic Easter egg hunt of a film that does the bare minimum to please its loyal existing fanbase. Those less enthralled by the antics of the moustachioed Italian plumber will wonder which of Donkey Kong’s weaponised barrels this joyless, noisy mess was scraped from. Read full review"], ["Robbie Collin", "", 0.2, "Somehow, this new animated adaptation of the video game is even worse than the abominable 1993 live-action. Even the CGI is second-rate. Read full review"], ["Kimberley Jones", "", 0.2, "But in going to such great lengths to avoid that film’s grim weirdness, the Super Mario Bros. Movie filmmakers have flattened the concept into benign nothingness. They’ve course corrected into the side of a mountain. There’s no heartbeat here. Read full review"]], [["PietStok", "Apr 5, 2023", 1.0, "From the graphical style, the characters (of course), the voices, the music/sounds, the plot, etc. to the easter eggs (which made me tear up)... EVERYTHING breathes Nintendo and it's amazing for real Nintendo & Mario fans. A MUST SEE!"], ["Unkn0wn_Dev", "Apr 10, 2023", 0.9, "no tengo ni idea de porque la critica ha sido tan dura con esta pelicula, nadie se esperaba una obra maestra, solo querian una peli entretenida para toda la familia, y eso es exactamente lo que illumination y nintendo nos han dado. el detalle\n\n\n\n\n\n… Expand"], ["NINTELDRITCH", "Apr 13, 2023", 0.9, "Don't listen to the critics (mostly). A movie doesn't need to have the deepest story to be good. First of all, the characters. Illumination and Nintendo actually did a phenomenal job here. The two basically main characters of the film are\n\n\n\n… Expand"], ["Antony454", "Apr 9, 2023", 0.9, "This review contains spoilers, click expand to view. … Expand"], ["Adudog", "Apr 10, 2023", 0.7, "This review contains spoilers, click expand to view.\n\n… Expand"], ["BeeWhoop", "Apr 10, 2023", 1.0, "Amazingly fun movie that doesn’t take itself too seriously. If you like the sonic movies then you’ll love this one."], ["rfalario", "Apr 10, 2023", 1.0, "It is impossible not love this movie who played Mario. Each details was constructed for fans."], ["Rosa0273", "Apr 10, 2023", 1.0, "Es una película que no pierde el sentido de su origen el cual son los video juegos, es entretenida y me encanta."], ["itachi_ds3", "Apr 11, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["Galen", "Apr 14, 2023", 0.9, "I was really worried that this was going to be a bad movie when it was first announced. A lot of the marketing did little to dissuade me from this outlook. Happy to report however that the movie was fantastic. Has a nice backstory with a lot… Expand"], ["aurun", "Apr 15, 2023", 1.0, "Captures the essence and doesn't pander to rotten critics who wanted this or that instead of you know, Mario in the Mario movie."], ["JoseAlfonso", "Apr 15, 2023", 1.0, "Beautiful. This isnthe movie I expectes to see 35 years ago when I was 5. Even cried of nostalgia when I saw punchout....."], ["LaroTayoGaming", "Apr 17, 2023", 1.0, "Of course we have critics ruining this movie. Well, they clowning themselves right now because of a highest grossing film"], ["BradMorgan", "Apr 15, 2023", 0.9, "This film is visually amazing and a feast of recognition. A gift for the fans, made for young and old. The movie seems to be the start of much more within the Nintendo Universe."], ["RudolfLeeb", "Apr 15, 2023", 1.0, "Maravillosa\nMe encantó\nLleno de referencia No solo para fans de los juegos"], ["tellmikeyy", "Apr 15, 2023", 0.8, "After watching it twice, I can simply say this is a great family movie with many references to OG Nintendo fans & both humor filled & action packed scenes that leave you enjoying the movie from start to finish."], ["AxskuII", "Apr 14, 2023", 0.9, "Movie was amazing much better than expected. Might be one of the best music soundtracks in a movie in a long time so much to love, so much nostalgia. Critics are actually braindead at this point."], ["Bigman82", "Apr 14, 2023", 0.9, "9/10 The movie was great, the characters were great, the movie looked amazing and peaches is the best song ever. i just think it should be a bit longer and luigi should of got more screentime"], ["Ale508", "Apr 15, 2023", 0.9, "(sorry if my english is bad, im Italian)\nAs a normal movie, this barely a 6/10. But as a MARIO movie this is definitely a 8/10. Then why did i put 9/10?\nFirst of all, this movie is the definition of fun. The characters, details and the music\n\n\n\n\n\n\n\n… Expand"], ["CanadianFrog", "Apr 15, 2023", 0.9, "It's a fun and enjoyable movie that has its own unique style compared to the video games without straying too far from its source material. Most of the voice cast is surprisingly solid. Illumination's art style mixes well with the art style… Expand"], ["Smort", "Apr 17, 2023", 1.0, "Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches Peaches… Expand"], ["Infinity868", "Apr 14, 2023", 1.0, "It is beyond any doubt that the Mario movie was not only made by very talented people, but also loyal fans. It's packed full of references and it really feels like the movie takes place in the Mario universe, instead of just using the names… Expand"], ["Sinashahabi", "Apr 14, 2023", 1.0, "Good. Good. Good. Good. Good.Good. Good. Good. Good. Good.Good. Good. Good. Good. Good.Good. Good. Good. Good. Good."], ["Leoyoshicritic", "Apr 5, 2023", 0.9, "9 le falta algo en las escenas en cines que manejen imax son buenísimas las escenas es en mi opinión es la mejor película de adaptacion de juego a película por qué es buena lo que pasa es que la prensa como ya todo lo que sea adaptación de… Expand"], ["Atatito", "Apr 11, 2023", 0.7, "I wanted to give this movie a 10 to offset all the unfair and bad reviews, but it's just a 7. The movie is really all that it needed to be. It's nothing mind-blowing, but at least it's better than all the other Illumination movies. My main… Expand"], ["Williamhooper", "Apr 13, 2023", 1.0, "Absolutely brilliant. Not a huge nintendo fan, but did play some of the games on the N64. This film had everything, and I would encourage anyone who has any memory of mario or history with nintendo consoles to see this film. No idea why the… Expand"], ["Bonierm89", "Apr 14, 2023", 1.0, "Awesome movie!!! A must see!!! This one is a love letter from Nintendo for all of us!!!"], ["ILikeHam", "Apr 14, 2023", 1.0, "Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario Mario"], ["Bernkastel345", "Apr 14, 2023", 1.0, "It is not perfect by any means, but it rewarded my inner child that had been yearning for a good mario movie. The movie gave me goosebumps and gave every character a perdonality I feel fits them perfectly."], ["eduvalenca", "Apr 14, 2023", 1.0, "Excelente filme, gostei bastante das referências, ri e me diverti muito.\nO filme é bem simples, com um enredo bem objetivo, não existe reviravoltas ou nada parecido, é apenas um filme para família, leve, livre, colorido e mágico."], ["OscarH93", "Apr 15, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["Idunno123", "Apr 15, 2023", 1.0, "Surprisingly a perfect movie and successfully captured the essence of the source material"], ["Victordeth", "Apr 16, 2023", 1.0, "Amazing . I love it watch with my family .\nF#ck LGbT Critics . Live the games out this"], ["AlbertoGramsci", "Apr 6, 2023", 1.0, "Una película que cualquier fan de la franquicia y nintendo disfrutara de inicio a fin. Divertida y visualmente deliciosa."], ["Gordonnr", "Apr 8, 2023", 1.0, "Movie was wonderful. I took my whole family and one friend to the movie. 6 people total. We all loved it. Still talking about it now. Loved the music and want to see the movie again."], ["Juancho1337", "Apr 8, 2023", 1.0, "It’s as great as it’s going to get as far as a nostalgic experience. I’m 38, and I enjoyed it for what it was, a joyous romp through a world I discovered in my adolescence and played everyday with my father. I was born in 1985 the year it… Expand"], ["Kdog152", "Apr 14, 2023", 1.0, "This review contains spoilers, click expand to view.\n\n… Expand"], ["Barca1985", "Apr 6, 2023", 1.0, "What are these critics smoking? It's a fun movie with a good story! I'd highly recommend it."], ["waddle_dee", "Apr 8, 2023", 1.0, "Great movie, what the movie reviewers get wrong is that they all watch movies so they haven't played much of the games so they don't get all the references, you need to watch it for yourself to truly understand. This movie is for players, not… Expand"], ["LeRoy14", "Apr 6, 2023", 0.9, "This is never going to be a full cliffhanger, hilarious movie. It’s aN ANIMATED MARIO MOVIE. Just to set expectations from the start. Why are people so negative these days ? This is a VERY GOOD KIDS/FAMILY film. You don’t have to be a… Expand"], ["Kaihaku", "Apr 7, 2023", 1.0, "The critics are out of touch and have forgotten that it's okay for a family film to be simple, joyful, and fun. The 90s Mario film was ruined because its filmmakers tried far far too hard to twist joyful Mario into something edgy, dark, and\n\n… Expand"], ["Grumppi", "Apr 8, 2023", 1.0, "The best movie I've seen in the theater in years! Lots of fan service. Respects the characters. Kid friendly. NOT WOKE! Awesome job Nintendo"], ["Kacak321", "Apr 5, 2023", 1.0, "awsome movie, excieded my expectations. Solid voice acting, fun easter eggs and many suprises."], ["KoopaTrappa", "Apr 8, 2023", 0.9, "The entire movie is a love letter to Nintendo fans and anyone who played Mario as a kid. It won't appeal to people who never play video games (like most film critics) so it's not for everyone - but it's a great movie for anyone who has kids… Expand"], ["lucidgate", "Apr 6, 2023", 1.0, "If you are a Nintendo fan you will enjoy this movie. Lots of easter eggs and references."], ["andresbfg1", "Apr 5, 2023", 1.0, "Sonic ya era muy buena película, pero está superó mis esoectativas de fan."], ["LoomBoom", "Apr 8, 2023", 0.8, "This movie was a lot of fun. The critics and metacritic are wrong on this one. Its story and characters nothing mind blowing, but they are endearing. Anyone that likes the games will love this movie and the general audience will have a good… Expand"], ["GeorgeMV719", "Apr 6, 2023", 1.0, "Es una película llena de acción, diversión, referencias por todos lados, doblaje increíble y por sobre todo que es una carta de amor a los fans de Nintendo."], ["greninjaX", "Apr 8, 2023", 1.0, "it doesn't matter what the critics say. critics are completely irrlevant. it's a mario movie, and if you are reading this, you are going to see it if you haven't already."], ["Experiment626", "Apr 7, 2023", 0.7, "After a second viewing, I enjoyed this movie so much more. I guess my body can't handle staying up for the midnight previews anymore. It isn't the most elaborate of plots, but it has enough to satisfy its audience. Mario / Nintendo fans… Expand"], ["JJorg", "Apr 11, 2023", 1.0, "Great movie, rectified that mess they made in '93. My whole family had a great time watching this film, can't wait for more!"], ["Steprock", "Apr 8, 2023", 0.9, "Theater was packed. People had fun.\n\nThere were zillion game references and a very well realize Mario Bros world to enjoy.\n\nNot as powerful as the Puss in Boots film or The Incredibles, but still worth watching 9/10 for me."], ["Va2592yoshi", "Apr 8, 2023", 1.0, "Great family movie! So many Mario and Nintendo references! Loved it! Would love to see more Nintendo movies like this!"], ["Emmanuel7414", "Apr 8, 2023", 1.0, "personally I think it is a very funny movie that takes us back to our childhood and makes us enjoy again the adventures of Mario."], ["ChilliHippo", "Apr 8, 2023", 1.0, "Great animation movie, technically impressive, great action, colorful and funny. As a Mario fan I could not ask more. The story is meh, but I certainty did not go to watch it for the story as I knew that wouldn't be a meaningful one."], ["Supdun", "Apr 10, 2023", 0.9, "Many references that as a Mario fan, you will understand. Movie was quite a bit better than expected, would recommend!"], ["Dirac", "Apr 5, 2023", 0.8, "Good movie, does everything it needs to and does them right. Could it be better? Sure but with the crap thats come out lately this didnt need to try that hard to be good. Is rather silly at parts which seems to be in every movie as of late,\n\n\n\n\n\n… Expand"], ["Tr0nikus", "Apr 8, 2023", 1.0, "A fun film for the whole family that will surely disappoint scumbag contemporary critics. Why? Well the gay agenda, by some miracle, is nowhere to be found. A miracle how the producers were able to pull this off. Perhaps Rainbow Road was… Expand"], ["CelioYT", "Apr 5, 2023", 1.0, "This movie is perfect, PERFECT. The movie is the best adaptation video game based I ever see since Mortal Kombat (1995). The movie overall is super accurate to the Super Mario Bros. Universe. And it has all the references and the same vibes… Expand"], ["LeandroPaixao", "Apr 8, 2023", 0.9, "This review contains spoilers, click expand to view. … Expand"], ["ThorCarmine", "Apr 10, 2023", 1.0, "A fantastic fun family movie that isn't infected with a bunch of SFW BS or leftwing pandering. The movie focuses on being a Mario movie first and foremost, I would absolutely recommend this movie to anyone looking for a safe and fun movie to\n\n… Expand"], ["Bdebox", "Apr 6, 2023", 0.9, "Es una gran película, es algo que tienen que ver si les gusta o en algún momento disfrutaron de un juego de súper Mario Bros, el diseño de personajes es hermoso y los lugares que se visitan son increíbles."], ["Seaniekins", "Apr 7, 2023", 1.0, "100% one the most fun movies in a while. It was hilarious and genuinely captivating. Best movie for all ages."], ["FAM5150", "Apr 6, 2023", 1.0, "Awesome, that's all I have to say. Complete nostalgia from start to finish. From the characters, the powers/amps, to the soundtrack. The review is being too demanding for a game that doesn't have much of a plot. For me, it's 100% easy… Expand"], ["SMSpeedrun", "Apr 7, 2023", 1.0, "THE GREATEST MOVIE BASED OF A VIDEOGAME\nI Love it, Movie of the Year!!!!!!!"], ["LightProtector", "Apr 6, 2023", 1.0, "I was a bit anxious after initially seeing the critic reviews, but I decided to reserve judgement until I saw it for myself. Oh boy, I am so glad I did. This movie was seriously everything I expected. For the faults it has with a mediocre… Expand"], ["XEclipse360", "Apr 7, 2023", 0.9, "Ignore the critics, this the best video game adaptation I've ever seen. I'm more of a sonic fan, but even I think that this movie is better. My only nitpick is that I wish Luigi more than just being lock up. Other than that, this movie was perfect."], ["Raulix", "Apr 5, 2023", 0.8, "Great movie, but could be better if was for everybody, no only for Mario's fandom"], ["Rycey", "Apr 5, 2023", 1.0, "Beautiful animation and a ton of easter eggs, we all loved it. Even the voices were good."], ["chikiponmex", "Apr 5, 2023", 1.0, "Excellent movie. Do not listen to the haters and grace randolph wannabes. This is a nice love letter to every nintendo fan out there."], ["dharper7", "Apr 7, 2023", 1.0, "This was an enjoyable film that is made for nintendo fans, kids, and those who grew up with the franchise. This is not for cynics or internet reactionaries. Watch it, have fun and feel good."], ["EFYevan", "Apr 7, 2023", 1.0, "The fans really love this movie! This is one of those times where you should not trust the “critic” reviews. A great movie for all ages!"], ["enut_butter", "Apr 6, 2023", 1.0, "Great fun, family loved it. So much better than anything Disney puts out anymore. Can’t wait for the inevitable sequel it gets after eating the mouses lunch."], ["batusay", "Apr 9, 2023", 1.0, "Buenisima, mantiene toda la esencia de los videojuegos de mario pero sin perder lo que es una buena pelicula para toda la familia es increible,las animaciones y el diseño es espectacular muy bien cuidado, la musica esta a otro nivel es todo… Expand"], ["Fenrir138", "Apr 6, 2023", 1.0, "Nintendo’s first animated film in what will hopefully be an entire universe of movies based on their properties hits the ground running. The movie hits all the right notes with a tremendous amount of fan service that will please longtime fans\n\n\n\n… Expand"], ["EpicE611", "Apr 7, 2023", 1.0, "This is such a great movie! I saw it earlier in the theaters today, and it was better than I thought, I would totally recommend this movie to people. And BTW, Hollywood critics are dumb for their rating of this movie."], ["gebarros", "Apr 7, 2023", 1.0, "All i was expecting from a mario movie. A lot of references and characters."], ["GodBoyGeno", "Apr 8, 2023", 1.0, "I have been excited to go see a movie in theaters in a very long time. When I heard they were making a Mario movie I had hope that Nintendo wouldn't let it be overrun with leftist Hollywood politics and just make a fun movie but, I was\n\n\n\n… Expand"], ["MattTrains", "Apr 9, 2023", 1.0, "This is my favourite movie EVER! :D\nShowing nearly every single Mario game ever and great adventures! :)"], ["victorsmash15", "Apr 5, 2023", 1.0, "Es un increíble viaje que nos lleva de un nuevo videojuego de Mario directo a la pantalla grande. Sin la necesidad de una historia compleja, ni una representación sobre la ansiedad, \"Super Mario la película\" transmite la magia que nos da el… Expand"], ["Bleimer", "Apr 5, 2023", 1.0, "Obra maestra de animación y un perfecto homenaje a Mario y a las miles de horas de diversión que nos ha dado con sus juegos, increíble pelicula 10/10"], ["CaptainGoomba", "Apr 5, 2023", 0.9, "While The Super Mario Bros. Movie has many shortcomings with it's paper-thin plot, relentless pacing, and changeup of characters, it's overall a fantastic film that will please fans with easter eggs and families with a charming story."], ["MildorZalost", "Apr 6, 2023", 0.9, "Great fan service, colorful, extraordinary animation and music, this movie gives everything a fan would have wanted from a modern Mario movie.\nCritics who are saying the movie is \"souless\" have clearly never played a mario game, it is not\n\n… Expand"], ["TawXic", "Apr 5, 2023", 1.0, "The wait is finally over we have a Mario move and it’s better then expected down to the animation, the humor, the story and last but not least the Easter eggs :) hats off to Nintendo and Illumination"], ["NBbowler", "Apr 5, 2023", 0.9, "The movie is a love letter to Mario and Nintendo fans. Longtime gamers will recognize many of the melodies from various games as well as jam out to classic songs you’d hear on a classic rock station. All the Easter eggs and references made… Expand"], ["abears", "Apr 6, 2023", 0.9, "I love mario soo much and this movie felt unreal to watch I really believe that this movie was made by people who love mario and gives me hope and excitement for new nintendo films but if they make a zelda movie and i hear link talk im losing… Expand"], ["CalvinCrack", "Apr 6, 2023", 0.7, "This is like a 5/10 story. Wrapped in 10/10 animation. With 10/10 fan service & callbacks. I give it a C+ on its own terms. I think it has the makings of an A, if only they fleshed out the characters more and had an actual second act. It… Expand"], ["sonicpulsar", "Apr 8, 2023", 1.0, "An absolute blast from start to finish. A fun and crazy non-stop ride with some of the best animation I've seen to date. Nintendo x Illumination definitely made an incredible work."], ["mikezero", "Apr 6, 2023", 1.0, "Finally a best videogame movie ever!!!\nI enjoyed a lot like when I was a child passing hours playing Super Mario Bros"], ["JERAMCR", "Apr 6, 2023", 1.0, "a movie full of nostalgia as it has references to all the Mario Bros video games, an excellent movie"], ["Queso924", "Apr 6, 2023", 0.9, "Nunca me lo había pasado tan bien en una sala de cine. La película asombra desde el principio con una trama un poco floja pero fiel al lore de la saga.\nEs una carta de amor a los fans, con cientos de referencias por todas partes.\nSi has\n\n\n\n\n… Expand"], ["Gouken128", "Apr 5, 2023", 1.0, "Super fun. Recommended 100%. We are a bunch of friends in our 30s and we enjoyed it a lot, and the quality of the graphics is amazing. You leave the cinema wanting more!!! We want the next one asap!!"], ["Cenodude", "Apr 9, 2023", 0.9, "Absolutely a very likeable and lovely movie. Excellent executed. A must watch for all mario fans."], ["Alejale", "Apr 7, 2023", 1.0, "The movie is impressive. The references to the video game are not boring under any circumstances. I highly recommend it."], ["simplicity14", "Apr 10, 2023", 1.0, "I went in to this movie thinking it would be at least average to decent, and I ended up being blown away. Definitely not a critic's movie, but that's not who this was for anyway. As a lifelong Nintendo gamer that's played basically every\n… Expand"], ["candymanrar", "Apr 10, 2023", 1.0, "\"Es todo lo que podrías haber esperado de una película de Mario (...) Captura el espíritu de los juegos, la historia e increíbles posibilidades que han ofrecido durante décadas, en una de las películas de animación más divertidas en años.\""], ["Kirnl", "Apr 10, 2023", 1.0, "Another movie that shows movie critics are no longer needed as they are so far out of touch with the general population it makes reading their reviews pointless. Great movie with heaps of throw backs to the games."], ["saulodourado", "Apr 10, 2023", 1.0, "I didn't have high expectations for this movie, but it ended up being really nice! I loved it, and my 9-year-old daughter loved it even more. They did a good mix with between the franchises Mario and Donkey Kong."], ["BreViking", "Apr 5, 2023", 1.0, "This film was unabashed joy in a bright, mushroom kingdom wrapper. The characters are warm and fun. I appreciated the characterizations and even the oft criticized casting of Chris Pratt was actually surprisingly good. Jack Black chews up the… Expand"], ["kdo_nascimento", "Apr 8, 2023", 1.0, "Um filme maravilhoso. Cheio de referências. Sem dizer que é um filme de uma das franquia mais amadas."], ["nofx911", "Apr 5, 2023", 1.0, "If you like Super Mario games or well done animation then this movie is for you! I definitely recommend it for all ages that enjoy Nintendo games, Mario, Bowser, DK and all of the Mario Galaxy goodness!"], ["vgolev", "Apr 9, 2023", 0.9, "Review from adult with no much of interest in Mario games: great movie to go with kids. Great for both kids and adults. We liked jokes, animation, daughter also liked games’ references. They added gameplay elements from Mario games carefully.\n\n… Expand"], ["nastjuska", "Apr 7, 2023", 0.9, "Very entertaining. It stays true to the source material, which I really liked. This studio did not try to rewrite characters in order for them to fit in with the current society standards."], ["Aces423", "Apr 6, 2023", 1.0, "This movie was amazing. It was very nostalgic with all of the referenced material and music. Will go back to watch it again."], ["JCastro_1492", "Apr 8, 2023", 1.0, "Mi opinión corta es: De las mejores películas de animación de la historia. Ademas recrea el universo de Mario como no lo hace ninguna película basada en videojuegos, esto es una oda a Nintendo,. Bravo Nintendo e Ilumination. Ahora viene mi… Expand"], ["Sparki26", "Apr 7, 2023", 1.0, "This move felt like a beautiful love letter to Mario fans. The amount of references it has is outstanding, the soundtrack is just beautiful and it sticks to its roots, unlike many other movies that rather go for popular horrible rap or pop\n\n… Expand"], ["PrimeTactiks", "Apr 8, 2023", 1.0, "Excellent movie. Don’t listen to critics see it and judge for yourself. Top 3 video game movie."], ["Gemesi92", "Apr 11, 2023", 1.0, "the best videogame movie ever made, its perfect, if this film value is 50, every marvel film value is 0"], ["Ewas228", "Apr 8, 2023", 1.0, "One of the best movies in past few years. CGI pretty solid, plot from start till the titles very interesting, especially final phase where one battle phase starts during another battle part, and every combat moment have a lot of action, I… Expand"], ["Josefodx", "Apr 5, 2023", 1.0, "Una ola de referencias impecables, todo lo que siempre se ha querido percibir de los juegos a la pantalla grande, simplemente INCREÍBLE."], ["Nintenderek", "Apr 8, 2023", 0.8, "To start, this movie does not hold up well on it's own if you have not played the games. I think most people who are big Mario fans will really enjoy it, but if you aren't a Mario fan, nor do you have children, this probably isn't the movie… Expand"], ["AngrySeaOtter", "Apr 11, 2023", 1.0, "Do not trust Critic Reviews. If you are a Mario fan, you will have smiles on your face the whole time. My friend does not play video games, but he said that he enjoyed the movie and would give it 8 points."], ["Odyssey1022", "Apr 11, 2023", 1.0, "Funny and entertaining, I had a blast! Ignore the negative critic reviews, they are idiots."], ["MusclyMcGee", "Apr 5, 2023", 0.8, "When rating kids movies you gotta look through the eyes of a younger self instead of an adult. When I was wee I only cared about how exiting and cool the movie looked, and this movie looked great and exiting. I can dismiss the not very… Expand"], ["ND-Bringer", "Apr 8, 2023", 0.7, "Honestly, this movie was way better than I expected to be. Genuinely, I haven't been satisfied with a video game film like this for a long time. And that's explicitly due to the simplicity of this movie. Illumination wasn't aiming to make… Expand"], ["Forest1991", "Apr 7, 2023", 1.0, "Cool movie, I like it ☺️. It's better that lots of modern films! Good luck Nintendo characters in future!"], ["sergioodoardi", "Apr 6, 2023", 0.9, "All the movies related critics and websites should go straight to hell. This movie is amazing and you can tell easily. It's a must see."], ["Zeldiano88", "Apr 7, 2023", 1.0, "Se un film di Super Mario andava fatto DOVEVA essere cosi. Perfetto, grande Miyamoto. 10/10"], ["Danielromeo", "Apr 6, 2023", 1.0, "Excelente película!! Hecha con mucho cariño y que llega en el mejor momento de Mario y de todos los fans a los videojuegos."], ["metacriticador", "Apr 6, 2023", 1.0, "Esta buenísima hermano, todo, en especial la parte visual, es preciosa, llena de referencias a los videojuegos y una trama no antes vista, con un humor sutil y efectivo, sin temor a equivocarme estamos ante la próxima ganadora del óscar a… Expand"], ["JuanaPalotes", "Apr 5, 2023", 1.0, "Best animated movie YTD. Loved to see Peach and Bowser on the big screen. I want to see more Nintendo's movies."], ["Sanix20", "Apr 5, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["Derep", "Apr 8, 2023", 1.0, "It was really fun. As a fan of the game it was very satisfying. Also I prefer the peach's changed character from game."], ["Ropcorp", "Apr 8, 2023", 1.0, "Great wholesome movie, true to the nature of the characters and the game. One of the best video game animated movies. Highly recommended from old fans to kids who are new to the franchise."], ["saturdaydude", "Apr 7, 2023", 0.9, "Fun movie, super enjoyable for people of all ages. Chris Pratt is still a questionable choice."], ["Mene0", "Apr 6, 2023", 0.7, "Definitely a movie for fans. The story feels a bit rushed but it does the job. I can see how someone that isn't a video game player wouldn't like this very much, but it appealed very well to me, with the soundtrack and the little references\n… Expand"], ["32maze", "Apr 8, 2023", 0.8, "There is a lot you can say about this movie but i was hyped and laughing the entire time. If your a mario fan then you'll find refrences almost every 3 seconds (not joking). The music is great, the animation is incredible and the writing too.… Expand"], ["Frankxyni", "Apr 8, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["alanpotter17", "Apr 6, 2023", 0.7, "This review contains spoilers, click expand to view.\n\n\n\n\n\n\n\n\n\n… Expand"], ["SmashingBasil", "Apr 6, 2023", 1.0, "In reality this movie is a solid 8 nudged it up a bit to counter the ridiculous critic reviews\n\nFilm is a fun family film which is what anyone with more than a few brain cells would be expecting when going to watch a animated Mario film"], ["paulosouza", "Apr 6, 2023", 1.0, "the movie is amazing, the fallow the game perfect and not only Mario but you see more game from nintendo there. i really liked perfect"], ["elbaifas", "Apr 6, 2023", 1.0, "La mejor pelicula que he visto en lo que va del año, tiene muchas referencias a juegos de nintendo, ahora toca esperar para la parte 2 :p\n\nRECOMENDABLE PARA VER EN FAMILIA"], ["Soniquedj21", "Apr 5, 2023", 1.0, "Eu amei o filme é muito fiel a história eu Hoje que me revelei fã absoluto da Nintendo eu posso te falar eu recomendo e levem a família e vou assistir de novo"], ["sharky0456", "Apr 7, 2023", 0.7, "its a verry good movie and the actors did a good job the only issue i have with the movie is its pacing is just too fast and it feels like they really did set out all these ambitions and then compressed it all into a 1hr 30 minute movie in my… Expand"], ["Desmonde2", "Apr 6, 2023", 0.9, "it's an amazing movie but I think the plot isn't perfect especially because games like Mario's one don't have an interesting plot"], ["Emanuele112", "Apr 7, 2023", 1.0, "Molto bello per uno che ha giocato tutti i giochi e riesce a cogliere la maggior parte delle citazioni"], ["ViruSNooB", "Apr 6, 2023", 1.0, "serio nao sei quem foi o mané que nao gostou do filme mas eu digo que gostei muito um belo filme e uma excelente adaptaçao muito bom mesmo espero ter continuaçao"], ["Muphu", "Apr 6, 2023", 1.0, "Awesome movie with a lot of great references, both original score and 80s sountrack is amazing, all mushroom kingdom and brooklyn delivery an interesting world"], ["sonictonic", "Apr 6, 2023", 1.0, "Went in with tempered expectations, and came out so pleasantly surprised. The critics have no clue what they're talking about. For Nintendo and Mario fans, this movie is absolutely fantastic. I was smiling the whole time and I can't wait to… Expand"], ["Luis125", "Apr 5, 2023", 1.0, "The Best videogame movie ever made, it is everything that can be expected from a super mario movie, the movie is faithful to the video game, it is also fun for all audiences, it is full of references for veterans in the saga as well as for… Expand"], ["ALEelcritico", "Apr 5, 2023", 1.0, "los criticos no saben de videojuegos pero el fandum si me gusta las referencias y lo mejor es que casi todo el mundo conoce a mario"], ["NRoyalX", "Apr 5, 2023", 0.9, "I don't understand those who gave this movie less than at least 6/10. Yes, the story wasn't as deep as it was in many other movies, but that's because it is a completely different genre! The movie was everything I expected it to be and more,… Expand"], ["MVPdu33", "Apr 6, 2023", 0.9, "Excellent film\nAction et fun au rendez-vous Plusieurs références au différents jeu vidéos"], ["kairon_gonzaga", "Apr 8, 2023", 1.0, "Ótimo filme, vozes, músicas, retratou bem a maneira como a nintendo fez o universo de super mario, está de parabéns."], ["CTAN", "Apr 5, 2023", 1.0, "I personally highly recommend this film. I'm glad that this film doesn't follow the disastrous woke trend, but sticking on the original setting of game characters and game world. I watch it with my family, and we have lots of fun time."], ["AugustNeon", "Apr 5, 2023", 0.9, "Amazing film for fans of the franchise! So many callbacks and easter eggs. Great animation, solid voices, etc."], ["franzeayrs", "Apr 5, 2023", 1.0, "Great movie awesome go watch nice plot awesome story Great movie nice voice acting"], ["mrkoopatuxedo", "Apr 5, 2023", 1.0, "I always try to be genuine when it comes to the Big N. I will criticize them if they deserve such, and praise them if they deserve it too. A few years in the history of Nintendo stand out to me like 2009, 2013, 2017, and now 2023. If you are… Expand"], ["Ramsakai", "Apr 5, 2023", 1.0, "Es una película de Mario bastante sólida, el Reyno champiñón jamás se sintió tan vivo"], ["Aivin", "Apr 5, 2023", 1.0, "Nice movie with a ton of references to the mario games. Maybe the only downside was mario's voice but i didnt really care as much"], ["alvaromagnum", "Apr 6, 2023", 1.0, "It is a very good movie for fans and non fans. Recommended. Bring your kids."], ["Chrilo", "Apr 7, 2023", 0.9, "Many references from Mario's video games. All that fans need to see with the fantastic artwork and animation. It's a full fan service movie so I enjoyed so much!! I'm waiting for more Mario and Nintendo movies like this."], ["KiWii69100", "Apr 5, 2023", 0.9, "For a first animation adaptation, it's pretty good, the film is full of nods to the game and the Mario universe in general. Very good experience in 3D!"], ["EdwardJStar", "Apr 5, 2023", 1.0, "Everything from top to bottom, this movie was filled with life everything is so livelly and colorfull (too colorfull actually). But the thing is the easter egg of course theres many of them. The fan service in this movie in mind blowing (not… Expand"], ["Marnandez", "Apr 5, 2023", 1.0, "Fantastic movie! If you are a big fan of Mario or played the games, THIS MOVIE IS FOR YOU."], ["Pybo", "Apr 5, 2023", 1.0, "Been wanting a super mario bros movie for years and it's finally now real, ITS EXACTLY WHAT I WANTED GO WATCH THE MOVIE, SO GOOD"], ["Keffey", "Apr 10, 2023", 1.0, "Ótimo filme, cheio de referências e nostalgia do começo ao fim! Sempre esperei por uma adaptação de qualidade do Mario para os cinemas e finalmente chegou. O filme mantém sua proposta de agradar o publico infantil e os mais velhos que… Expand"], ["tbizzle39", "Apr 6, 2023", 0.8, "This movie was about a 7.5 for more. Don't listen to the critics. It was thorougly enjoyable and very nostalgic. Don't expect a once in a lifetime story and just go in and expect to have a good time."], ["samichsupernova", "Apr 12, 2023", 1.0, "Amazing fan service. Lovingly and carefully written interpretations of the characters. It is obvious Nintendo took great care in supervising Illumination and crafting a film that would appeal to fans and kids alike. Mario and Peach are… Expand"], ["raiden5", "Apr 10, 2023", 1.0, "Thats why we love nintendo, simple and family fun movies and games, without toxic woke nonsense."], ["StefanGoedhart", "Apr 6, 2023", 1.0, "My family and I have been riding the Nintendo hype train for 30 years and Nintendo never fails us. Nintendo respects all the fans and they ALWAYS over-deliver and give us a lot more than expected. Critics who're not in this warm Nintendo bath\n\n… Expand"], ["PS4_PC_LIFE", "Apr 5, 2023", 0.8, "Figured the useless critics would review bomb it, did no one see this coming, the movie is a solid 8, cant complain, Seth Rogan is a lazy POS cant even do a proper voice, no idea why they even asked em to be DK."], ["Gamer2068", "Apr 8, 2023", 1.0, "Faithfully to the source material. Fun and entertaining. And the visuals oh my!"], ["yoshi8869", "Apr 6, 2023", 0.7, "Despite my immense love for the Mario franchise, I went into this film expecting trash. Video games don't translate to cinema. But I found myself halfway through suddenly realizing there weren't any glaringly bad elements yet. Now, I'll warn\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n… Expand"], ["TheSparton", "Apr 5, 2023", 1.0, "Masterpiece for long time fans. I can’t really fault it. Full of charm, nostalgia and the perfect plot for Mario+Luigi. Animation and voice cast also spot on. After all the backlash, Pratt nailed it (albeit a younger sounding Mario which… Expand"], ["Achiles1211", "Apr 5, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["Lemmonlightaz1", "Apr 5, 2023", 1.0, "The best movie so far this year. Do not listen to the critics. They don't know what they're talking about. They are very stupid"], ["Joseafc1", "Apr 5, 2023", 1.0, "Es difícil digerir semejante obra de arte. La mejor película que han echo basadas en video juegos. Mucha nostalgia, muchas referencias. Animación excelente, música excelente. Soy fan de Xbox y nintendo. Con esta pelicula terminé amando mucho… Expand"], ["VictorWeb", "Apr 7, 2023", 1.0, "Добрый, милый мультфильм. Слава Богу без современных \"течений\"."], ["Serginius", "Apr 5, 2023", 1.0, "Excelente, por fin una película que se basa 100% en el juego. No dejemos que la \"guerra de las consolas\" llega al cine. Muy entretenida y con grandes colores. Recomendada"], ["TristanSou", "Apr 6, 2023", 1.0, "Es maravillosa, me llevó de regreso a mi infancia, es Mario en estado puro, no pretende inventar nada y por eso es perfecta, la música, la animación, los personajes son perfectos. Si te gustan los videojuegos te va a encantar."], ["DanielOsterne", "Apr 5, 2023", 1.0, "Gostei bastante! Ensina bons valores! Toad robou a cena! Ao contrário do que falaram, o filme possui boas piadas."], ["Weidenwiesel", "Apr 10, 2023", 1.0, "A movie for the fans with the studio focusing on entertaining the audience and NOT lecturing them on garbage woke ideologies.\nNo wonder this movie easily outperforms anything else that came out of Hollywoke the past years.\nAs a long-time-fan\n\n\n\n\n\n… Expand"], ["Mutty99", "Apr 6, 2023", 1.0, "Great experience! Nintendo fans will love this movie, and I sure did as well :)\nIt's full of references to not just Mario, but also other Nintendo franchises. Rearrangements of the tracks are on point, and the story flows well. Must see!\n\n… Expand"], ["xYxKINGxYx", "Apr 6, 2023", 1.0, "amazing loved it. brings me back to the 90s and that's all I can ask for. kept me and the kids entertained."], ["Jorgom", "Apr 6, 2023", 1.0, "A love letter to the 30+ years of Mario history. Truly one, if not the best, videogame movie to date."], ["daniel_dbv", "Apr 6, 2023", 1.0, "An amazing movie full of references from Mario games , beautiful music, and incredible grafics. I loved every single frame! I recommend it so much!"], ["Bryantabares", "Apr 7, 2023", 1.0, "One of the best videogames movie adaptations, bring back memories, is really fun, action packed, a lot of laughs, explains a lot from thebmarios videogames. Simply amazing, would watch again!"], ["Muskybobo", "Apr 7, 2023", 1.0, "To put it simply, this was a GREAT, FUN, NOSTALGIC movie for everyone! 17 of us went which included kids and our grandkids. If you are looking for a \"message\" this is NOT for you. This is for people that just want to be entertained in a fun… Expand"], ["Blokin", "Apr 5, 2023", 1.0, "I have to give it a 10 because it’s LITERALLY impossible to do a video game movie adaptation better than this. It’s impeccable for what it is. I dunno what those who criticise the story expected. It’s not ‘The Brothers Karamazov’, itsa… Expand"], ["GarethCox", "Apr 8, 2023", 1.0, "The movie is brilliant from start to finish. It stays true to everything you know about the video games. I don't understand all the criticisms if I'm honest. I think it's great the film doesn't take itself seriously and simply delivers a… Expand"], ["DavidJoestar", "Apr 6, 2023", 1.0, "La película es una obra Maestra, disfrutable por todo público, altamente recomendada , está hecha con muchísimo amor"], ["IsacoDC", "Apr 6, 2023", 0.9, "Es una película que nos recuerda el mundo de los videojuegos y porque a muchos nos enamoro desde niños. Es divertida y excelente para recordar todas las veces que intentamos pasar un nivel."], ["yz20030802", "Apr 6, 2023", 1.0, "电影很棒。它非常怀旧所有参考材料和音乐。会回去再看一遍。"], ["CineMaster", "Apr 6, 2023", 1.0, "What an adventure. I am always skeptical of game-> film adaptions but this was overall a very good time.\nYou’re going to get what you expect with this one.\nNice job."], ["TheCoker", "Apr 5, 2023", 1.0, "Great family movie with a stunning animation.A linear story true to the Mario series. A love letter to Super Mario players both old and new. The Mario Kart sequence is amazing and so is the final act. The Kongs were a standout. Good voice… Expand"], ["isaicota", "Apr 5, 2023", 1.0, "Straight to nostalgia, I loved it, it's very good animation and story, I give it 10/10, it was worth every minute in front of the screen"], ["TryHard202", "Apr 6, 2023", 1.0, "This is a amazing movie for family's, anyone can enjoy and is a cinematic masterpiece, the animation is beautiful. All voices actors were incredible. Although the story and characters development were lacking, it doesn't need to be that deep… Expand"], ["Jescobar021983", "Apr 6, 2023", 0.9, "In the length of time allotted for the movie, you have to be constantly moving. This movie is constantly rolling with some pacing issues here and there. However, the Mario characters were represented very well and the action pack nature of… Expand"], ["JULIANROGO_YT", "Apr 6, 2023", 1.0, "Me gustó mucho la película y sabe representar el videojuego en la película y se siente como si uno fuera un niño con su primer juego de mario"], ["Sk1w4lk3r", "Apr 6, 2023", 1.0, "The film is wonderful. He plays all the time with all the elements that made the game a success. The story is simple but engaging. The soundtrack, with the game's classic songs repackaged and placed at the right time. The dubbing in Brazilian… Expand"], ["Phaco78", "Apr 6, 2023", 1.0, "This review contains spoilers, click expand to view. … Expand"], ["Kaua_ZS", "Apr 6, 2023", 1.0, "perfect movie full of references who is a mario fan will love it looking forward to the continuation"], ["Duraaaaan", "Apr 6, 2023", 1.0, "Very funny to watch and full of references from the videogames, the story advances in a strange way but instead fills it with iconic characters"], ["KirkDJohnston", "Apr 8, 2023", 1.0, "I just enjoyed the whole thing to be honest.\n\nReally, both my wife and I absolutely loved it and would give it 10/10 each for delivering exactly what we wanted from a Super Mario Bros. movie. \"Professional\" movie critics and naysayers be\n\n\n\n… Expand"], ["DDDOM", "Apr 8, 2023", 1.0, "AND THE DREAM COME TRUE ! Illumination and Nintendo teams up for THE BEST MOVIE FROM A VIDEO GAME EVER ! It’s a great time for family and for Super Mario fans ! The story is very good for a family movie. The art direction got perfectly the\n\n\n… Expand"], ["Mario999999", "Apr 8, 2023", 1.0, "This movie is armazing for public of all years old, the unic problem in this movie is duration"], ["Epsilon080", "Apr 8, 2023", 0.9, "If you are a diehard Mario/Nintendo fan, you will absolutely adore this film and all the neat references it has. Also a really solid film in it's own right. Though I will say that the story does go a little too fast at some moments. The… Expand"], ["dahc91", "Apr 10, 2023", 1.0, "This movie was great!!! It was a love letter to anyone who loves the games. Casting was excellent. It was so nice to see a movie without a woke agenda being shoved down our throat. Take notes Disney."], ["shanzz", "Apr 5, 2023", 1.0, "jack black was jamming on the piano and made me ejaculate so hard when I head his song"]]]