[[["Kevin Maher", "Mar 18, 2022", 1.0, "A beloved, incessantly revisited, stone-cold classic."], ["Michael Clark", "Oct 24, 2021", 1.0, "Unmarketable upon box office release, Darabount's masterpiece tanked and seemed destined to obscurity. Only after the video release, did 'Shawshawk' reap the praise it so richly deserved. Is it one of the greatest films ever made? Without a doubt, yes."], ["Matt Brunson", "Sep 17, 2021", 0.75, "The most overrated movie of all time still offers much to enjoy."], ["Allison Rose", "Sep 14, 2021", 0.9, "The entire cast of this movie is terrific with Robbins and Freeman leading the way."], ["Fico Cangiano", "May 25, 2021", 1.0, "A masterclass in pretty much every category. An incredible script, wonderful direction, gorgeous score and phenomenal performances by Freeman and Robbins. Cinema doesn't get any better than this. [Full review in Spanish]"], ["Mike Massie", "Sep 24, 2020", 1.0, "A magnificently hopeful, inspiring work of art."], ["Richard Propes", "Sep 22, 2020", 1.0, "Creates a stellar vision that teaches, challenges, inspires, and evokes a wide array of emotions and thoughts."], ["Sarah Boslaugh", "Mar 24, 2020", 0.8, "And the final scene? I'm not crying, you're crying."], ["PJ Nabarro", "Aug 21, 2019", 0.4, "The problem with the film's fablistic flooziness is that it also asks for investment in the harsh realities of its prison arena to buy the later Andy and Red push for freedom."], ["C.H. Newell", "May 6, 2019", 1.0, "One of the best out of the 1990s, and a towering force of dramatic power amongst films of its kind."], ["Mal Vincent", "Jan 8, 2019", 0.875, "It has the novelty to use plot development rather than unnecessary shock treatments to move forward."], ["Dave Kehr", "Sep 22, 2015", 0.75, "This is an engagingly simple, good-hearted film, with just enough darkness around the edges to give contrast and relief to its glowingly benign view of human nature."], ["Gene Siskel", "Jan 16, 2013", 1.0, "Simply marvelous entertainment."], ["Ian Nathan", "Jun 15, 2011", 1.0, "If you don't love Shawshank, chances are you're beyond redemption."], ["Heather Boerner", "Dec 18, 2010", 0.8, "Gritty but comforting story of friendship."], ["John J. Puccio", "Nov 19, 2008", 0.8, "...itself a testament to overcoming odds. It is sentimental and stereotyped, yet we are able not only to suspend our disbelief but to root for it all the way."], ["David Nusair", "Jul 30, 2008", 1.0, "...has certainly earned its reputation as one of the most effective prison movies in cinematic history..."], ["Betsy Bozdech", "Oct 22, 2006", 1.0, "The kind of inspiring tale that we love the movies for in the first place."], ["JoBlo", "Jun 24, 2006", 1.0, "An amazing movie. Easily one of the best movies made during the 90s and definitely one of the top 'prison' movies of all-time. Pretty much everything about this movie works and works extremely well!"], ["Phil Villarreal", "Mar 10, 2006", 1.0, "An unhurried, engulfing prison drama."], ["Chuck O'Leary", "Jan 25, 2006", 1.0, "The Shawshank Redemption works not only as an excellent prison drama, but as a metaphor for overcoming our own private prisons."], ["Walter Chaw", "Dec 17, 2004", 0.5, "Drawn in straight, brutal lines."], ["James Brundage", "Oct 31, 2004", 0.8, "The Shawshank Redemption is one of those films that is a true work of both art and magic."], ["Rafe Telsch", "Oct 18, 2004", 1.0, "One of the few movies that has come out in my lifetime that I consider a \"classic film\"."], ["Ed Gonzalez", "Oct 16, 2004", 0.375, "Beaches for straight men."], ["Jeffrey M. Anderson", "Sep 27, 2004", 0.875, "The Shawshank Redemption sprawls out over a leisurely 142 minutes, operating with the same unflagging patience of its protagonist."], ["Nev Pierce", "Sep 14, 2004", 1.0, "Freeman, in particular, is exceptional. His performance is so unshowy it can easily go unnoticed, but it's the soul of Shawshank."], ["Michael Dequina", "Jan 13, 2004", 1.0, "Flawlessly acted and directed, this film packed the strongest emotional wallop out of any film [in 1994]."], ["James O'Ehley", "Oct 1, 2003", 0.6, ""], ["Ryan Cracknell", "Jul 30, 2003", 0.8, ""], ["Leonard Schwarz", "May 20, 2003", 0.375, "The Shawshank Redemption continually abandons plausibility in order to celebrate the triumph of hope over despair, of decency over cruelty, of justice over injustice."], ["Janet Maslin", "May 20, 2003", 1.0, "Without a single riot scene or horrific effect, it tells a slow, gentle story of camaraderie and growth, with an ending that abruptly finds poetic justice in what has come before."], ["Rumsey Taylor", "May 7, 2003", 0.8, ""], ["Jeffrey M. Anderson", "Apr 29, 2003", 0.6, "Manages to be sentimental without sugar-coating."], ["Pablo Villaça", "Apr 22, 2003", 1.0, "Indubitavelmente, a melhor adaptao j feita de um trabalho de Stephen King."], ["Audrey Rock-Richardson", "Apr 8, 2003", 1.0, ""], ["Brian J. Arthurs", "Apr 7, 2003", 1.0, ""], ["Robert Roten", "Mar 23, 2003", 1.0, "Characters worth caring about and who actually learn something about themselves as the film progresses."], ["Steven Snyder", "Mar 5, 2003", 1.0, "The Shawshank Redemption is most memorable thanks to its ingenious surprises."], ["Mike McGranaghan", "Feb 13, 2003", 0.8, "Thank goodness this has become a classic!"], ["Ken Hanke", "Feb 12, 2003", 0.8, "It's good, but not nearly so good as it thinks."], ["Shannon J. Harvey", "Feb 10, 2003", 1.0, "One of the late 90s best - and most popular - films, this tale of enduring hope can be enjoyed in repeated viewings. Beautifully scripted, superbly shot, and sumptuously scored. Morgan Freeman's words (as narrator) will stay with you forever. One of the m"], ["James Rocchi", "Nov 7, 2002", 0.7, "By blanketing the prison experience with a sepia-tone haze of nostalgia and placing it in a time that's part history, part Normal Rockwell, the film provides a trip through the belly of the beast that isn't too icky..."], ["Scott Weinberg", "Jul 27, 2002", 1.0, ""], ["Dan Jardine", "Jun 27, 2002", 0.8, "despite occasional lapses into familiar formulas and stereotypes, this is a first-rate prison drama"], ["Peter Travers", "May 12, 2001", 0.9, "It's the no-bull performances that hold back the flood of banalities."], ["Andrew Howe", "Apr 2, 2001", 1.0, "One of the greatest films ever committed to celluloid."], ["Marc Savlov", "Jan 1, 2000", 0.8, "At times poignant, joyful, and terrifying, Shawshank Redemption is an altogether brilliant movie and the debut of an equally brilliant director."], ["Peter Stack", "Jan 1, 2000", 0.75, "Thanks to fine performances and beautiful photography, you get that inspirational jump-start frame after frame."], ["Rita Kempley", "Jan 1, 2000", 0.9, "It's a devoutly old-fashioned, spiritually uplifting prison drama about two lifers who must break their emotional shackles before they can finally become free men."], ["Brian Webster", "Jan 1, 2000", 0.83, "When the film's conclusion starts to unfold, you suddenly realize that this is one of the more inspiring films you've seen in a long time - yet you don't feel the least bit manipulated."], ["Christopher Null", "Jan 1, 2000", 0.8, "It is able to sustain itself throughout its duration and to keep you enraptured with its remarkably hopeful story."], ["Dragan Antulov", "Jan 1, 2000", 0.6, "Terribly overrated, but its pluses nevertheless outweigh minuses."], ["James Berardinelli", "Jan 1, 2000", 0.875, "The Shawshank Redemption is all about hope and, because of that, watching it is both uplifting and cathartic."], ["Mark R. Leeper", "Jan 1, 2000", 0.875, "This is a film with excellent production values almost without exception."], ["Desson Thomson", "Jan 1, 2000", 0.4, "It wanders down subplots at every opportunity and ignores an abundance of narrative exit points before settling on the aforementioned finale."], ["Roger Ebert", "Jan 1, 2000", 0.875, "If the film is perhaps a little slow in its middle passages, maybe that is part of the idea, too, to give us a sense of the leaden passage of time, before the glory of the final redemption."]], [["Patrick R", "Apr 18, 2023", 1.0, "I saw this a few weeks ago and it was very good!"], ["Stefano B", "Apr 18, 2023", 1.0, "A movie I can watch a hundred times and I will feel exactly like the first time."], ["Jacob K", "Apr 17, 2023", 1.0, "Its a great heart-warming story and is great. One of the most iconic movies of all time. 5 out of 5."], ["Lance B", "Apr 17, 2023", 0.8, "With great performances and solid direction, The Shawshank Redemption is a very satisfying drama. The ending perfectly wraps up the story, with the good guys finally free to do what they want, and the bad guys ousted from their places of power. The movie is enthralling from start to finish with never a dull moment. Definitely a classic!"], ["Mike T", "Apr 17, 2023", 0.8, "The only thing that is wrong/fake about this movie is Andy banging on a super thick steel pipe with a rock and making the audience believe that he could make a hole in it to get away. Unrealistic. He might as well used a loaf of bread."], ["Rogelio S", "Apr 15, 2023", 1.0, "Un gran clásico, infaltable para todo cinéfilo."], ["Jose Luis P", "Apr 15, 2023", 1.0, "Una obra maestra! Una de las películas de mi vida."], ["David H", "Apr 14, 2023", 1.0, "Had no idea what I was walking into the first time I saw this. The movie me and a few friends wanted to see was sold out, so we decided to see this Shawshank thingy in it's place. As the closing credits rolled, I remember turning to my friends. No words. We all just kind of looked at each other, like \"What the Hell just happened?\" Anyway, I've seen this film many times since. Holds up every time. The movie is a masterpiece."], ["Haydee W", "Apr 14, 2023", 1.0, "This is SO far so good movie, I very like it"], ["Yeremia P", "Apr 14, 2023", 1.0, "This movie is Great about self freedom, I just love how they represent about life in prison, the main character is also such genious and I never thought there was a such plot twist there honestly, I also love the relationship between every character in this movie"], ["Oscar T", "Apr 13, 2023", 1.0, "One of the greatest movie ever！"], ["isa e", "Apr 13, 2023", 0.7, "hated in theatre , grown to appreciate it, brilliantly acted"], ["Dinos K", "Apr 13, 2023", 0.9, "Wonderful film with excellent performances by almost all the actors, it got me thinking about the meaning of freedom and the power of habit"], ["Eugene W", "Apr 13, 2023", 0.8, "The Shawshank Redemption is a cinematic masterpiece that expertly weaves together themes of hope, friendship, and redemption. The performances by Tim Robbins and Morgan Freeman are outstanding and the story is both heartwarming and thought-provoking. Highly recommended!"], ["Lucas G", "Apr 12, 2023", 1.0, "Beautiful, sad, exciting. Unforgettable performances, unforgettable characters. The Shawshank Redemption (for me) is flawless."], ["Yuiki L", "Apr 12, 2023", 0.9, "It is a remarkable movie. Everyone should watch at least once."], ["Chuck N", "Apr 12, 2023", 1.0, "Excellent movie, especially Morgan Freeman"], ["StephenPaul C", "Apr 11, 2023", 1.0, "The most awesome 02 hours: and 22 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"], ["Josve T", "Apr 11, 2023", 0.9, "It's a film must to see. The best Prison Drama ever made."], ["chris C", "Apr 11, 2023", 0.9, "a timeless masterpiece that is truly deserving of all the praise it has received. From the outstanding performances to the gripping storyline, this movie has it all. One of the standout features of the film is the exceptional acting. Tim Robbins and Morgan Freeman deliver stunning performances that bring their characters to life in a way that is both authentic and compelling. The chemistry between the two is remarkable, making their friendship all the more touching. The storyline is another element that sets this movie apart. The plot is masterfully crafted, taking the audience on a journey that is both emotional and thought-provoking."], ["Jose P", "Apr 11, 2023", 0.9, "Shawshank Redemption is one of the finest movies made and shown during the 1990s that help the spirit of those people who have been victims of injustice. Tim Robbins as Andy portrayed his role perfectly as the prisoner who sought redemption on the crime he did not commit and outsmarted a rotten prison system. He was witnessed by Morgan Freeman (Red) who believed in his mission to freedom. This film is bold, inspiring, entertaining and easily a collector's gem."], ["Doug Y", "Apr 11, 2023", 0.9, "The film holds you very much, a simple prison where you want to know what the future of the prisoners will be. The characters are very charismatic, and what captivated me the most in the film is the simplicity that took place in the film"], ["Chad P", "Apr 10, 2023", 1.0, "You can tell by this very film if a critic is poor. Any bad review instantly proves they don't know anything about film. This held the highest spot on RT for many years. There is a reason. The filmography the casting the direction the lighting the sets the background extras. Nothing was skipped nothing was overlooked. It is a masterpiece of teaching how a film is made. Take your time and engross yourself in one of the greatest movies ever filmed."], ["Angel B", "Apr 10, 2023", 1.0, "Una de las mejores películas que he visto en mi vida. Fácilmente entra en un top 10 a nivel general, con una trama y significado magnifico deja muy en claro sus personajes y lleva muy bien la trama y desarrollo de cada personaje. No soy una persona que llore con muchas cosas pero esta película me llego al corazón y siempre me saca varias lagrimas."], ["Benjamin W", "Apr 10, 2023", 0.8, "This is by far, the best Morgan Freeman role ever. There's not much I have to say, it's just a really awesome movie."], ["Juan C", "Apr 10, 2023", 0.9, "Acabo de descubrir esta joya de película y en tantos sentidos es excelente. Por favor véanla."], ["Steven J", "Apr 10, 2023", 0.9, "a great movie with a great performance from Morgan freeman watch it"], ["R M", "Apr 10, 2023", 1.0, "One of the top 20 movies of all time. Period."], ["streng g", "Apr 9, 2023", 1.0, "One of the Best Movies of all Time."], ["Kathy M", "Apr 9, 2023", 1.0, "strongly recommend, the story is fascinating"], ["YU M", "Apr 9, 2023", 1.0, "Many people come to Shawshank prison, slowly institutionalized, become a walking corpse like existence. Andy from the entry to the escape, the whole 19 years, he is always with hope, the hope of freedom. Andy's behavior is comparable to a firefly in a dark world, a faint light, this firefly, despite the faint light, but is the only light in Shawshank prison. In this weakness of the Shawshank prison, Andy used his own a small hammer to chisel out the road to freedom, the road to freedom. Andy inspires us to be brave and move forward, even in the face of different setbacks, we still have to find ways to face them and solve the problems bravely."], ["Ana Mara R", "Apr 9, 2023", 1.0, "Just in the beginning of the movie you just now that is gonna be one of you new favorite , the history is just so unique and perfect."], ["Grant S", "Apr 9, 2023", 0.8, "One of those films that sticks with you."], ["Jeffrey G", "Apr 9, 2023", 0.9, "Brace yourself - I did not gove this 5 full stars. The movie is truly awesome. But, it is almost like you aren't allowed to not think it is perfectly elegant perfectly perfect. First of all, it is a fairy tale. Prisons suck. They are filled to the brim with psychos, crooks, heartless folks, and a total breakdown civilization. How creative, for the villain to be the warden! Although it is uplifting, excellent movie with great characters it misses grot to be perfect."], ["Jason G", "Apr 9, 2023", 1.0, "Love this film, one of the best films ever made"], ["Jyl B", "Apr 8, 2023", 1.0, "A must see classic. Morgan Freeman and Tim Robbins are phenomenal in this take on prison life, corruption, survival and learning what it means to fight for what is right."], ["", "Apr 8, 2023", 1.0, "The best movie I've ever seen, it really moved me!"], ["Benn H", "Apr 8, 2023", 1.0, "Amazing movie, one of my favorites"], ["Dale C", "Apr 8, 2023", 1.0, "Perfection in every aspect of movie making,. A story that takes you on an emotional journey where you become invested in the characters. Those characters are played by tremendous actors who reel you in with amazing performances. Direction, cinematography, costume, and production design"], ["KilznaH 46", "Apr 8, 2023", 1.0, "One of the best movies ever"], [" ", "Apr 8, 2023", 1.0, "《肖申克的救赎》是一部非常经典的电影，让人们看了之后对人生有了更深刻的领悟。影片中所展示的人生经历和悲欢离合，使观众产生了共鸣。影片中，安迪·杜佛兄弟凭借自己的聪明才智与坚韧不拔的精神，成功逃出监狱并最终获得了自由。在这个过程中，他也体验到了人生的辛酸和孤独，这让观众们很容易就能从他身上看到自己的影子。这部影片告诉我们，在生活中，我们每个人都需要有那种不屈不挠的精神和勇气去追求自己的梦想和自由。即使我们遭遇到种种不公和困境，也不能轻易放弃，只有坚持到底才能获得真正的胜利。所以，这部电影对于观众的启示和感动是非常深刻的。"], ["El G", "Apr 7, 2023", 1.0, "Really good, griddy. Watch this if you haven't."], ["Davi A", "Apr 7, 2023", 1.0, "The plot of the film is very surprising, the character building is fabulous and we are always concerned about them."], ["Valeriya P", "Apr 7, 2023", 1.0, "\"The Shawshank Redemption\" is a cinematic masterpiece that has stood the test of time. The film explores the harsh realities of prison life, including corruption, violence, and the struggle for survival. However, it also highlights the power of hope, friendship, and the human spirit. Andy befriends fellow inmate Red (played by Morgan Freeman), and the two form a bond that lasts throughout their time in prison and beyond. Robbins and Freeman deliver outstanding performances, capturing the depth and complexity of their characters. It is a visually stunning film, with sweeping cinematography and powerful imagery that captures the bleakness of prison life."], ["Graham S", "Apr 6, 2023", 1.0, "My favorite movie of all time"], ["Antonio M", "Apr 6, 2023", 1.0, "Isso sim é um filme! Muito bom."], ["Jesse B", "Apr 6, 2023", 1.0, "All scenes are as memorable as Abraham Lincoln in his nobility!"], ["S T", "Apr 5, 2023", 1.0, "Wonderful movie! Great actors"], ["Jon", "Apr 4, 2023", 1.0, "As absolute a perfect movie as can be from beginning to end. I could be browsing channels and come up on Shawshank - no matter what scene - and just watch it until the end. I can't say that for most movies."], ["Selina T", "Apr 1, 2023", 1.0, "Seen this many times loved it! Good story!"], ["Tony M", "Mar 31, 2023", 1.0, "The Shawshank Redemption is a timeless classic. It's a movie I can watch time and time again. Morgan Freeman narrates the story beautifully and what a story. A must see if you haven't."], ["Jackson87", "Mar 29, 2023", 1.0, "The Shawshank Redemption is widely regarded as one of the greatest movies ever made, and it's easy to see why. Directed by Frank Darabont and based on a novella by Stephen King, the film is a powerful meditation on hope, redemption, and the resilience of the human spirit. The movie tells the story of Andy Dufresne, played by Tim Robbins, a man who is wrongfully convicted of murder and sent to Shawshank State Penitentiary. In prison, Andy forms a friendship with fellow inmate Red, played by Morgan Freeman, and sets about using his intelligence and resourcefulness to survive and even thrive in the brutal and oppressive environment of the prison. One of the strengths of The Shawshank Redemption is its nuanced portrayal of the characters. Andy and Red are complex and multifaceted individuals, and their friendship is depicted with a depth and authenticity that is rare in Hollywood films. The movie also features a talented supporting cast, including Bob Gunton as the sadistic Warden Norton and William Sadler as the troubled and tragic Heywood. But perhaps the greatest strength of The Shawshank Redemption is its message of hope and redemption. Even in the darkest and most hopeless of circumstances, the movie suggests, there is always the possibility of redemption and the potential for a better future. Andy's determination to survive and maintain his humanity in the face of incredible adversity is inspiring and uplifting, and the film's ultimate message of hope and renewal is both moving and profound. Visually, The Shawshank Redemption is also a masterpiece. The film's cinematography and production design are both striking and memorable, and the use of music, particularly the haunting and beautiful score by Thomas Newman, adds to the movie's emotional impact. Overall, The Shawshank Redemption is a powerful and deeply moving film that resonates with audiences on a profound level. Its themes of hope and redemption are universal, and its message of the transformative power of human connection and resilience is one that will continue to inspire and uplift viewers for years to come."], ["Bod e", "Mar 28, 2023", 1.0, "Többször nézős film. Mély, elgondolkodtató téma, Egyrészt az intézményfüggőség, őszinte barátság két rab között, ahogy a színészek előadják ja és a remek szinkron még inkább emeli a film nézettségét."], ["Rahul B", "Mar 28, 2023", 1.0, "Man! Wt a movie, I gave a salute to the movie after i finishing watching the movie, if you ask me wt is best film I watched in my life is I would say The shawshank Redemption & Mayabazar. Wt a great movie, this is a once in a lifetime experience."], ["topokki L", "Mar 27, 2023", 1.0, "An inspirational film about \"hope\" and \"redemption\"."], ["Tyler V", "Mar 26, 2023", 1.0, "One of the greatest movies of all time. This movie haunts you, while simultaneously giving you a feeling of hope and happiness."], ["Ron P", "Mar 21, 2023", 1.0, "My youngest daughter couldn't believe I had never watched this movie. I finally got around to it 28 1/2 years after its release date. Glad I did. What could I possibly write that hasn't already been written by more than a couple hundred thousand-plus others? If I had four thumbs, they'd all be up."], ["Charmeuse M", "Mar 16, 2023", 1.0, "The movies that were called the dark horse of the industry were unexpected and impressive movies that will stick in your mind for a long time. A drama film called Shawshank Redemption is the story of a banker, Andy Dufresne, who was caught up in the murder of his wife and her adultery then. Their story is about the rest of his life in the Shawshank prison, the friendship, and the pain of reality. One of the most interesting parts of this movie is that it is told from a third-person point of view, which gives a new perspective by using an indirect approach. It depicts a lot of inequity in prison life, but the focus point in this movie is hope. The hope that could rarely be found in a place that was called \"hopeless,\" such as prison, is the reason why the movie wants to show freedom in ways that people could never have imagined that people in prison would still have hope. This is not the normal prison film that audiences expect about jailbreak, but this movie leads to a different feeling. It's gained emotion through the situation that the characters have been through, and even more emotion is gained by the impressive ending. The movie always showed you some phases that demonstrated the truth of being human; that will definitely hit you. You will be able to relate a scenario, a character, or a situation in this simple movie to something deeply personal in your own life after experiencing it. This kind of movie is great to keep watching more than once because your thoughts and perspective on it will change as you grow up. Shawshank Redemption could of course be called an encouraging film, and that is also the aim of the director, but in my understanding, this film is bittersweet and more bitter than sweet. Because the character's pain is shown a lot in this film, the key is how he deals with the situation and how it would be if there were a condition in the situation. But what is beautiful is the strong relationships that exist in this place, and you will feel that while watching it. Along with great performances from actors like Morgan Freeman and Tim Robbins, it was one of the best. But there are also live support acts that are absolutely brilliant and impressive. Although most of the scenes of the film take place in a tense place. I would recommend this movie for the two and a half hours that it is worth for people who want to experience a simple but golden movie story like The Shawshank Redemption. You will even more clearly understand why this movie is the highest rated on IMDB. However, I recommended this movie to older teenage audiences because some of the content in the movie is violent, and the context of that content will become clearer to this generation or older. Finally, The Shawshank Redemption offers you a variety of experiences that will definitely give you brilliant pleasure."], ["frederick c", "Mar 10, 2023", 1.0, "One of the best films I've ever seen, can barely find anything to fault. Some very well created characters with some brilliant performances to compliment. Showed many different aspects of life in and around prison."], ["swang l", "Mar 5, 2023", 1.0, "One of the best movie at all time"], ["Lee", "Mar 1, 2023", 1.0, "A legendary classic of a movie. A must watch!"], ["Joshua C", "Mar 1, 2023", 1.0, "Possibly the quintessential story of the strength of the human spirit, Frank Darabont's \"The Shawshank Redemption\" is an uplifting film about friendship, hope and the power of perseverance in a unfair and cruel situation which is brought to life by a realistic plot, great dialogue, a powerful score, memorable characters and iconic performances, led by Tim Robbin and Morgan Freeman. Greatest movie of all time? Possibly."], ["John B", "Feb 28, 2023", 0.9, "Shawshank Redemption is very indicative of a classic, all time great movie. My only complaint is that it drags a bit going into the final hour of the movie. But getting over that, the audience heads into one of the greatest endings ever that wraps up the story wonderfully."], ["Michael S", "Feb 27, 2023", 1.0, "This movie is just the definition of a masterpiece, from the beginning to the end I was hooked on all the the way. Morgan freeman narration is just so satisfying. I would want him to read me a bed time story. This movie I consider to be better than the novel by Steven king. But in the end I just love this movie."], ["Eka R", "Feb 23, 2023", 1.0, "Being one of the best 90's movies, The Shawshank redemption's inspiring story makes for a gripping drama"], ["Drew H", "Feb 21, 2023", 0.8, "9.3/10 Story 8.5/10 Acting & Filming 9.8/10 Satisfaction 1.5/5 Humor My score: 83%"], ["Drika B", "Feb 20, 2023", 0.9, "Filme lindo, maravilhoso, forte e sensível."], ["Jackson K", "Feb 20, 2023", 1.0, "I really don't know how any movie can top this. Great acting, great story, great character development… I could keep going. 10/10"], ["Kevin K", "Feb 16, 2023", 1.0, "One of my favorite movies of all time!"], ["jay v", "Feb 14, 2023", 1.0, "Absolute Masterpiece. This movie has set the standard from which I judge every other movie."], ["Alain M", "Feb 11, 2023", 1.0, "\"The Shawshank Redemption\" is an absolute masterpiece of filmmaking. This timeless classic tells the story of Andy Dufresne, a man wrongfully convicted of murder who finds hope and redemption in the form of friendship at Shawshank prison. With stunning performances from Tim Robbins and Morgan Freeman, this film masterfully blends drama, humor, and hope to create a movie experience that will stay with you long after the credits roll. The direction by Frank Darabont is flawless, and the script, adapted from a Stephen King novella, is nothing short of brilliant. If you haven't seen \"The Shawshank Redemption,\" do yourself a favor and watch it. It's a truly fantastic movie that should be on everyone's must-see list."], ["Goran M", "Feb 9, 2023", 1.0, "One of THE GREATEST movies ever"], ["mikkel b", "Feb 8, 2023", 1.0, "if i could give it 100/10 i would it is abseloutley the best movie i have ever seen ALL TIME FAVORITE!!!"], ["Joseph H", "Feb 8, 2023", 1.0, "The movie takes you further than the short story. Very well acted. A must see for everyone!"], ["Pat U", "Feb 3, 2023", 1.0, "The greatest movie ever made. Period."], ["Carlos Alfonso C", "Feb 2, 2023", 1.0, "Absolute Masterpiece with amazing dialogue, great characters, extremely satisfying ending, along with extremely tense drama that all equates to one of the best movies of all time."], ["TOMI D", "Jan 27, 2023", 1.0, "A great emotional story with awesome actors, and a really well written script."], ["farah r", "Jan 25, 2023", 1.0, "While it might not be the most pleasant experience, movies aren't only made to be enjoyable. They are also made to be enlightening, thought-provoking, and impactful; and that's exactly the kind of film the Shawshank Redemption is. It tells a deeply moving story about hope through the brilliant performances of Tim Robbins and Morgan Freeman, heightened by Thomas Newman's beautiful score. It's no wonder that this uplifting, well-crafted masterpiece is still considered one of the best films in cinema history."], ["mo a", "Jan 19, 2023", 1.0, "A masterpiece that tells a powerful story of hope, friendship, and redemption. The film's greatest strengths is its ability to convey a sense of time, as we follow the characters over the course of several decades, and the passage of time is shown through the characters' aging and the changes in the prison."], ["Roy V", "Jan 15, 2023", 1.0, "the best movie in history"], ["Dominik M", "Jan 5, 2023", 1.0, "Świetny Klasyk. Tylko ekranizację książek Stephena Kinga potrafią tak wzruszyć."], ["Calvin L", "Jan 5, 2023", 1.0, "So funny and so amazing. Always keeps you on your toes and is super unpredictable."], ["safoan s", "Jan 3, 2023", 1.0, "Great movie, one of the best if not the best I have ever seen. Satisfying ending."], ["Pasha M", "Dec 29, 2022", 1.0, "Best film ever i'v had seen"], ["Obi D", "Dec 22, 2022", 1.0, "Simply heartwarming yet deeply inspiring. A love letter to hope. Brilliant scripting and narrative brimmed with morals, motivations and life lessons. A treasured classic and an all-time favourite in my book."], ["red a", "Dec 20, 2022", 1.0, "Absolutely my alltime favorite movie! This is a timeless masterpiece."], ["Mark A", "Dec 16, 2022", 1.0, "Probably the best adaptation of a Stephen King story ever made. A masterpiece."], ["Hao Ian L", "Dec 15, 2022", 0.9, "It really is just a simple film, yet entertaining enough to keep you hooked. Though the rising action may seem a bit draggy at times, the climax makes up for it."], ["Muhammad Hermawan E", "Dec 12, 2022", 1.0, "up until today this is the best movie ever for me, I dont know exactly why, but I think one of them is how the ending is so satisfying, I think the set up, the scenes after scenes is carefully placed in a very genius way to achieve that ending."], ["Krytof K", "Dec 11, 2022", 0.1, "je nai sais pas parce que it was too long bye bye. (Its wolfin time)"], ["TOBY R", "Dec 4, 2022", 1.0, "Possibly the best movie of all time, the realism of this movie causes us to feel empathy for people who the general population think are just scum. This movie shines a light on inmates and endites the penal system with the character of Brooks, who is a perfect example of the true horrors of prison. since watching The Shawshank Redemption, I have not watched a movie with a better ending. I wholeheartedly believe that this movie has the most ingenious plot. The story is told so that we don't really realise what is happening until it has happened, but when we realise we can only marvel at the quality of scriptwriting. This movie feels like every single word is chosen specifically to build to something, absolutely everything that happens in this movie is relevant to the ending and that is what makes this movie so good. Although this movie isn't as gut-wrenching as The Green Mile, it still has some very emotional scenes. There is truly nowhere that this movie falls down; the cinematography is 10/10, the writing 10/10, and the ending 1000/10. I can truly not oversell how incredible this movie is. Bravo Darabont, truly the master of prison movies!"], ["k m", "Dec 3, 2022", 1.0, "Brilliant story fantastically acted. My favourite film of all time."], ["Zeverb", "Dec 3, 2022", 0.9, "he was redeemed - Strong 8/10"], ["jay t", "Nov 30, 2022", 1.0, "To best of knowledge still according to I'm IMDb.com and I'm sure a number of others this movie stands alone as hands down the best best movie ever made and rightfully so. Seriously it has amazing characters a incredibly interesting story about a man convicted of murdering his wife on a night he unfortunately got drunk yet planned to do something she was having a affair and sent to a prison run by a corrupt warden. I promise this one of the only movies ever made I can guarantee you won't be disappointed at all!! AT ALL!!!"], ["Ronatherase C", "Nov 29, 2022", 1.0, "A part of the film that stood out to me was the part when one of the prisoners made it out and went into the same apartment Brooks, a librarian at Shawshank, went to. It replayed the same routine Brooks had when he got out and had a sad atmosphere that screams the word \"institutionalized.\" A fellow prisoner in which I won't tell in hopes of spoilers, who got out wore a suit and tie along with a fedora. Who works at a grocery store bagging groceries and gettting used to the outside world. I really liked the movie, it had a very deep meaning into it. I would recommend it to other people and give it a ten out of ten. This movie led into quite a lot of plot twists. In which I really liked and I also liked how the ending turned out."], ["Quinn F", "Nov 28, 2022", 1.0, "Very good movie wished that they would have made another one"], ["anthony l", "Nov 26, 2022", 1.0, "One of the best movies ever made"], ["", "Nov 20, 2022", 1.0, "The Shawshank Redemption is a sensitive, moving, and deeply pleasurable prison movie for the viewer, blessed with excellent acting and a great script."], ["Bwri", "Nov 10, 2022", 0.9, "Such a good movie, first time watching it the other day and I loved every single second!!!"], ["Benjamin H", "Nov 9, 2022", 1.0, "Raw and totally captivating, The Shawshank Redemption uses Stephen King's 1982 novella as a starting point to create a masterpiece that is gorgeous to behold and rich on thematic depth and details, alongside gripping storytelling and powerful performances."], ["William S", "Nov 3, 2022", 0.9, "A modern-ish classic and should be considered a must watch."], ["Gage A", "Nov 1, 2022", 1.0, "Is a unforgettable overrated masterpiece, this movie worked well 10/10"], ["tim p", "Oct 30, 2022", 1.0, "Probably the best movie ever made. Universally loved and rightly so."], ["Helene D", "Oct 28, 2022", 1.0, "One of the best and touching movies I've ever watched"], ["Justin G", "Oct 25, 2022", 1.0, "Other than \"The Godfather I & II, this is the best film that has ever been made!"], ["ABC", "Oct 20, 2022", 0.9, "The best movie of the century. Anything else said is just very less. A lengthy movie but worth every minute of it."], ["Danielle M", "Oct 19, 2022", 1.0, "One of the best movies of our time in my opinion"], ["Afro M", "Oct 15, 2022", 0.7, "Combined 7.25/10 or 3.625/5 Mo: A full story of brotherly love. Still judging everyone of voting age in 1994 that kept the prison systems going how they are. 7.5/10 Keekz: This movie is long. Nice brotherhood, but yea, abolish prisons. 7/10 amrpod.com/episodes"], ["leon b", "Oct 13, 2022", 1.0, "Timelles masterpiece"], ["jonathan t", "Oct 9, 2022", 0.9, "What amazes me is that so call professional reviewers haven't given this 100%. I would discount anyone who gives this less then 95%. It is a masterpiece"], ["patrick h", "Oct 5, 2022", 0.4, "I don't get what all the hubbub is about,"], ["Natasha", "Oct 2, 2022", 1.0, "I have watched this film too many times to count. This is simply a brilliant film."], ["C18xyz_1", "Oct 2, 2022", 1.0, "It's amazing. Great plot , characters and atmosphere ."], ["red t", "Oct 2, 2022", 1.0, "There's very little that needs to be said other than watch this immediately. The acting is incredible with deep chemistry and dialogue. The cinematography is excellent with great memorable set pieces and well shot drama throughout the whole runtime. The editing and pacing are incredible telling the story but also delivering the timeless message of never losing hope as it is what makes us human. What's amazing most of all is how the film never feels overly sentimental or tugging at the heartstrings to make up for a lack of substance. The characters are rich with charm & flaws that make you care about them good or bad. The soundtrack is incredible as well. Without a doubt the is an All Time Classic."], ["Kevin P", "Sep 28, 2022", 1.0, "There is nothing I can say that hasn't already been said. Every time I watch it, I am as spellbound as I was the first time. It may stay away for a while, but retribution always has a way of coming home in the end..."], ["steve w", "Sep 25, 2022", 1.0, "Get busy livin, or get busy dyin."], ["The Dark Side Of the Moon P", "Sep 25, 2022", 1.0, "One of the greatest movies ever written and recorded."], ["Richard W", "Sep 25, 2022", 1.0, "Epically human. One of a few movie that genuinely changes you for ever after. The world is a better place for having this movie in it. A universal lesson in never giving up. Get busy watching it get busy dying."], ["Dax R", "Sep 23, 2022", 1.0, "a flawless masterpiece"], ["ibrahim e", "Sep 18, 2022", 1.0, "This is the best movie I have ever seen in my life, a fascinating story, deserved ending and a touching reality"], ["MrEvil - R", "Sep 16, 2022", 1.0, "The movie is one of my favorite's ever made."], ["Hyunjae L", "Sep 13, 2022", 1.0, "This movie is one of my personal favorites. A true cinematic masterpiece from start to finish. From the plot to the acting to the character development, Frank Darabront made an amazing film."], ["P K", "Sep 9, 2022", 1.0, "I used to think this was a perfect movie, without a single flaw. However, when watching it on high definition tv, the background on the roof scene is obviously green screen. I never noticed this back in the day on a standard definition tv. Other than that, yes, it's a perfect film. The coolest thing about this movie is the ending. 99 other directors would have ending the movie as Red rode the bus down to Mexico, leaving us to assume he eventually met up with Andy. The decision to actually show the embrace on the beach brought it all together and perfectly concluded a nearly perfect film. Cinematic masterpiece. It will never be outdone."], ["Doug H", "Sep 7, 2022", 0.8, "Steven King writes like someome who's never left his mom's basement. Still, an okay movie. Everyone seems to love it, although I find it unremarkable. Which is why I'm giving it 3 and 1/2 stars, dispite the fact that RT seems to want me to give it 5...and won't let me alter that score, for unknown reasons."], ["Steven M", "Sep 6, 2022", 1.0, "It is not just a movie. Its about human spirit and you can achieve anything in this world if it is with the right intention and if your heart is at the right place. A must watch. A classic movie."], ["Wendell A", "Sep 5, 2022", 1.0, "One of my favorite movies of all time. I find this film to be one of the best acted, best scripted and most entertaining of my life. So many outstanding moments throughout giving this film endless rewatchability."], ["Derek S", "Sep 2, 2022", 1.0, "This is my favorite movie of all time. The writing and the acting are amazing. Great twist at the end."], ["steve d", "Sep 2, 2022", 1.0, "A bona fide classic."], ["sharon h", "Sep 2, 2022", 1.0, "Brilliant! To this day it has still set the standard for what film can produce. Engaging throughout its entirety, this was certainly Tim Robbin's best role"], ["edoardo c", "Sep 1, 2022", 1.0, "undoubtedly a masterpiece"], ["TJ M", "Aug 30, 2022", 0.9, "This was the very first R rated movie I've ever seen and as a first R rated movie this was an amazing movie. It's got great characters, music, writing, sound design, editing and brilliant cinematography. And it's got lots of quotable lines. A true classic and it's sad that this film lost Best Picture to Forrest Gump."], ["david m", "Aug 28, 2022", 1.0, "Greatest movie of all time."], ["Moatassem M", "Aug 28, 2022", 1.0, "this movie is the greatest movie i have ever seen so emotional and so deep"], ["KNULL M", "Aug 23, 2022", 1.0, "Hope is a good thing, maybe the best of things, and no good thing ever dies. legendary movie and was greatest of all time is greatest of all time and will be the greatest of all time."], ["Kenneth S", "Aug 22, 2022", 1.0, "Contender for the greatest film of all time."], ["Tyler W", "Aug 20, 2022", 1.0, "Best movie of all time!"], ["magsstorm", "Aug 19, 2022", 1.0, "My parents sat me down last night and I have to say this is one of the best films of all time. The whole movie is just so perfect and the payoff is insane. There was no moment I though the film dragged. 10/10 must see!!!"], ["emmanuel barcelona q", "Aug 16, 2022", 1.0, "I F*cking loved it!!!!! I heard it was good but never imagined THIS GOOD!!!"], ["Diane B", "Aug 13, 2022", 1.0, "Forget Rosebud. This is one of the best movies ever made."], ["Sunny L", "Aug 9, 2022", 0.7, "This film will never get old."], ["lucas t", "Jul 22, 2022", 1.0, "esse filme é simplesmente incrível. O filme se mantém ótimo e excelente do começo ao fim.Sem dúvidas é um dos melhores filmes que eu já assisti."], ["Lasse I", "Jul 21, 2022", 0.8, "I thought it was a very good movie, kind of slow pacing though. You could also think it had an open ending.... Loved the acting and cinematography."], ["Marina T", "Jul 18, 2022", 1.0, "The first time I saw that film I was literally amazed, I have to say that is one of my favourites ones. It isn't surprising that it has excellent reviews and the best ones, with an amazed audience like me. This film has to do with a guy that managed to escape the prison using his intelligence, having hope that he would made it. I highly recommend you to watch it, I ensure you it will leave you satisfied!"], ["david b", "Jul 18, 2022", 1.0, "One of the greatest films ever made. In my top 10 or at the very least top 100 since there are so many great classic movies. Top scores for acting and plot. We need more movies of this caliber"], ["Ruhaan A", "Jul 18, 2022", 1.0, "The absolute greatest movie of all time"], ["Bill", "Jul 14, 2022", 1.0, "Masterpiece. Naysayers are inhuman monsters. I could write a masters thesis about the ending alone."], ["Rob R", "Jul 8, 2022", 1.0, "The greatest prison movie ever made, perfect cast and a realistic feel too the movie, You simply cant forget this movie once you have seen it...Master piece"], ["Ian M", "Jul 4, 2022", 1.0, "Undoubtedly one of the greatest films I've ever seen. Ever character has a full depth to them that few other films can bring."], ["JC O", "Jun 21, 2022", 1.0, "Excellent! Well done! Good story , feel good ending but very well told, thank really enjoyed it!"], ["ryan b", "May 28, 2022", 1.0, "One of the greatest films I've ever seen. I need to watch it again."], ["christian g", "May 25, 2022", 1.0, "A story about the power of hope and redemption in one's life and the impact it has one those around them. A man wrongfully convicted of a double murder finds new ways to change both his own and other's lives through various acts while serving his time in prison, and all leading up to a satisfying ending and strange retribution for his years of service."], ["kaden d", "May 19, 2022", 1.0, "THE best movie, period"], ["evan m", "May 18, 2022", 0.4, "Look. I understand that it's only predictable, melodramatic, and clichéd because everyone else copied it. It's still predictable, melodramatic and clichéd."], ["george r", "May 18, 2022", 1.0, "Greatest prison movie of all time."], ["tiffany16 w", "May 16, 2022", 1.0, "Quite possibly the most perfect movie ever."], ["Riley F", "May 14, 2022", 1.0, "One of the best movies ever created, filled to the brim with excellent characters and a breathtaking story."], ["ben h", "May 12, 2022", 1.0, "Everything is perfect in this movie! The best!"], ["Joshua K", "May 8, 2022", 1.0, "The Shawshank Redemption is a film I've wanted to watch for a while. Many regard it to be the greatest movie ever put to screen, and I might have to agree with that. While I went into it expecting a twist ending because that's what my family had told me to expect, a little unsatisfactory conclusion to me expectations. I do need to watch it again though, even though I just finished it 10 minutes ago. Morgan Freeman and Tim Robbins are great as the two leads, and for a prison flick, this one is surprisingly uplifting and very satisfactory in multiple aspects."], ["tomas a", "May 1, 2022", 1.0, "Focused all the way through, it's an amazingly written movie Tim Robbins and Morgan Freeman really made me go through the feels. A must see!"], ["maureen c", "Apr 28, 2022", 0.8, "One of the greatest movies of all time. It teaches about the injustices in life. I almost cried. ALMOST."], ["Mike J", "Apr 28, 2022", 1.0, "Man who appreciates prison drama says: \"The Shawshank redemption is a classic and a brilliant movie about friendship and hope. Wow, well that's totally accurate. I wholeheartedly agree. I can fondly recall really fun rainy afternoons as a kid spent watching this very friendly and life affirming film. Whenever, people have let me down or I lose help in people which has happened quite a few times in my life. This particular film encourages me to believe in the power of perseverance and the rewards that can come after you have endured, and let's sincerely observe Andy Dufresnes' unfortunate vicissitudes of circumstances he does a lot of waiting for a crime he didn't commit and doesn't deserve to pay for obviously. Finally, I have not been there for others either this film speaks to me(mind you in a very cerebral way)and says: \"people are capable of terrible atrocities but they are also capable of fantastic achievements and acts of goodwill\".(that last quote is a monologue reverberating in my mind."], ["joey v", "Apr 25, 2022", 0.9, "One of the best movies Ever made With a solid story, excellent writing and Oscar worthy acting they just don't make them like this anymore morgan Freeman really carries this film from start to finish"], ["Darth V", "Apr 24, 2022", 1.0, "its a must watch! one of the greatest"], ["Jacob M", "Apr 19, 2022", 0.9, "Forrest Gump deserved the win it got over this movie. Still an awesome movie, saddest part was Elvis dying."], ["Owen B", "Apr 19, 2022", 1.0, "What can I say, this film is a masterpiece, and I can't see how people could say otherwise. An all-time classic."], ["sam r", "Apr 11, 2022", 1.0, "Went into watching this movie knowing it's in most lists top 2 movies of All time. Despite some lofty expectations, it did not disappoint"], ["gareth d", "Apr 3, 2022", 1.0, "The ultimate, original bromance. Some old dudes sitting on a bench talking, but wow it's good."], ["clive e", "Mar 30, 2022", 1.0, "Just about the greatest film ever made"], ["Michael M", "Mar 25, 2022", 0.9, "The Shawshank Redemption is an eminently watchable prison drama featuring great performances, especially from Tim Robbins, Morgan Freeman, and Bob Gunton, gorgeous cinematography from Roger Deakins, and a clever script which does a brilliant job of adapting Stephen King's novella. Like Gene Siskel, I noticed many similarities to One Flew Over the Cuckoo's Nest, with themes of abuse of authority and society's mistreatment of its most vulnerable members, but Shawshank is more hopeful about our ability to progress and eliminate these abuses. Whether or not the film's belief in humanity's capacity for redemption is realistic, the rays of hope which permeate what otherwise could have been an exceptionally bleak film make it much more approachable."], ["dustin p", "Mar 18, 2022", 1.0, "Always watch when the opportunity arises. A near-perfect film."], ["ronald h", "Mar 14, 2022", 1.0, "Thoughts upon watching this film in 2022: It has the aura of a fairy tale. The prisoners, hard core as they may be, are like mythical creatures: Morgan Freeman as the kindly convict, James Whitmore as the tragic librarian, and Tim Robbins as the soft spoken but conniving Andy. None of them are realistic. They're romanticized. But we're captivated by them thanks to a great screenplay and strong performances. It's a man's movie. This was obvious the first time I watched it. I thought women might have a hard time relating to it. But after my recent viewing, I realized that a great story transcends gender issues and has universal appeal. William Sadler, in an early role, gives a strong supporting performance. Roger Deakins is, without doubt one of the finest cinematographers in the history of film. His camera work in this movie alone could be an entire class in film school. There are so many improbable scenes, like the beer drinking scene on the roof and the scene in which Andy broadcasts an opera record over the prison P.A. It's sheer romanticism—and we eat it up. Clearly, Andy is a Christ-like figure. It's a story that never fails. His \"death\" is his sentence and the beatings he takes in prison. His \"resurrection\" is his prison break. He does good for his brethren, but he has no mercy on the warden. The corrupt and hypocritical warden represents the money changers in the temple, and Andy, in righteous anger, overturns his table. The denouement of the film ties in nicely with an earlier mention by Andy of Robert Frost. The poem in question is \"Mending Wall.\" Those who have read it will understand. Lastly, I've never understood why this film, now regarded as a masterpiece, was a box office failure. What were people thinking in 1994? Or maybe they weren't thinking."], ["kent rock r", "Mar 14, 2022", 1.0, "This movie is so good, I cried a few times. My top prison movie."], ["Ed M", "Mar 2, 2022", 0.8, "Excellent! A classic!"], ["daniel p", "Mar 2, 2022", 1.0, "This movie is perfection. Plain and simple. Nothing more, nothing less"], ["kyle e", "Feb 24, 2022", 1.0, "Warning: Spoilers Shawshank Redemption is without doubt one of the best films ever made, and definitely the best film of 1994. Yes, it is better than Lion King, and I really like that too. It is not only enthralling but powerful and moving too. I will confess that I didn't understand it when I first saw it as a lot happens in the film, and I have now seen it three times. I seriously hope, that those who ignored the film when it was first released now recognise it as a great film, as it really is. The dialogue was extremely well-written, with lines that really stick in your mind. The cinematography and music are both gorgeous, and the prison itself is like a character that dominates the film. In the script, there are some true elements of Stephen King Now I admit I am not a huge king fan, and usually don't like coarse language in books. But in his books like It, which is very good, I have accepted the language represents brutality and rebellion, shown perfectly in the film with the battle of acceptance I suppose between the inmates and the superiors(like the scene with the warden yelling coarse language at the new inmates lined up in a row at the beginning.)The acting was exceptional. I am not hugely familiar with Tim Robbins, but he did a great job in a very demanding role. The best performance however, comes from Morgan Freeman as Red, who was seriously robbed of that Oscar, that he lost to Tom Hanks for Forrest Gump. Freeman reminds me very strongly, or his style of acting does, remind me of that of Sean Connery, suave yet very charismatic. Acting isn't just about your vocal range, it's about depth, which was what Freeman certainly had. In short, Freeman was brilliant in what could be his best performance. The scene where the inmates are listening to the Mozart aria over the speakers was a beautiful profound moment, and I actually cried in Brook's death scene. Very rarely do King adaptations translate-to screen well, because of the large scale of the author's books, with the exception of this and the Shining. Some like It and Dreamcatcher are genuinely memorable but have a number of flaws that prevent them from being classed as outstanding. And some, like Thinner and Tommyknockers that border on unwatchable. In conclusion Shawshank is a brilliant film, that is worthy of the credit it has been denied for so-long. 10/10 of course. Bethany Cox."], ["Ethan A", "Feb 21, 2022", 1.0, "One of the best movies I've ever seen. Fantastic story and acting. Will watch again."], ["daniel k", "Feb 12, 2022", 0.2, "Paul Rudd was not in this movie."], ["liam s", "Jan 18, 2022", 0.5, "Its not that amazing neither is it bad its just idk that cousin at the family reuinion that nobody cares about and they just stand their to make it look more crowded even though there not needed this film is not needed and the movie is just there."], ["rick w", "Jan 12, 2022", 1.0, "Does this movie needs a review? This is a classic and will always be one of the best movies ever made. A complex story told in such an easy to follow and exciting way, without losing its charms. This is a must watch for every movie fan."], ["Luca D", "Dec 23, 2021", 0.7, "Not sure why people consider this the greatest film of all time. Clearly those people just haven't seen enough good movies. This is a really good movie, but there are some stretches that make it maybe not so believable. Maybe its the best prison movie of all time? Though American History X showed how people can change in prison while this film just showed how a dedicated person can escape?"], ["rc s", "Nov 27, 2021", 1.0, "Best system break out movie..."], ["david a", "Nov 6, 2021", 1.0, "My favourite movie of all time. An absolute masterpiece from start to finish. Enough said."], ["joel h", "Sep 21, 2021", 1.0, "Few movies in this world are as powerful as The Shawshank Redemption. This well-crafted drama drags your emotions through the wringer, only to have them come out clean & full of hope on the other side. The story is unquestionably compelling and absolutely memorable. In addition, Tim Robbins, Morgan Freeman, and the rest of the cast create a collage of authentic characters that you both love & hate. This is a film that everyone should watch at least once a year to remind themselves of how good it really is."], ["robert p", "Aug 12, 2021", 1.0, "Tim Robbins makes this movie, after some S & M committed on this guy he starts to make friends with the Warden and Some Police working the Jail, but he gets his revenge after he gets out of Jail."], ["Xander M", "Aug 9, 2021", 1.0, "It speaks to the power of this movie that it's been one of my favorites since I was five years. Even a young child can see the power off this story."], ["severin d", "Aug 9, 2021", 1.0, "For a long, long time I wondered what was really going on. 9.3 out of 10 possible points on the world's largest film database IMDb, even before classics like The Godfather Part 1 and 2 and leader of some best lists. Yet it's just about a convicted banker who befriends Morgan Freeman and gets used to his life as a prisoner in Shawshank men's prison. But there's a lot more to this film than the blue-eyed setting up of modern movie clichés. For the crux of The Shawshank Redemption already lies in its ensemble. Tim Robbins and Morgan Freeman as the leading men in their absolute prime as actors. Secondary characters that integrate ideally into the scenarios of the protagonists and all have essential functions as their companions. Villains that seem generic from today's point of view, but for those times were unparalleled in cruelty. All of these ingeniously written roles have a hand in the plot, none of them feeling superfluous at any point. Of course, the film's trump card is the chemistry between Robbin's character Andy and Freeman's Red. After an initial distance, the two grow closer and closer as the film progresses, and within the nearly 30 years over which the plot takes place, they become almost inseparable. A down-to-earth and simple male friendship, where both of them share a terrible fate. How the two manage to carry each other through the cold harshness of prison life is gripping to follow. The individual scenes mainly belong to Robbin's Andy. This one is characterized by Red's over-voice and while this movie tool works in very few cases, it's a bull's eye here. It's not for nothing that Freeman's voice is considered iconic to this day. You have from the start that a man is telling his friend's story. Freeman's screen time suffers a bit as a result, but it doesn't take anything away from what is arguably the best performance of his career. Robbins delivers the much quieter and subtler performance, while Freeman excels in empathetic and even comedic monologues and dialogue at times. The rest of the cast adds to an all-around perfect ensemble performance. Foremost among them is Bob Gunton as the corrupt Warden Norton, under whose hypocritical posturing as a sensible Christian lurks a malicious layer that lends the film some (necessary) devastation. Whether The Shawshank Redemption is really the best film of all time is debatable. However, one thing can't be denied: From an objective point of view, it is without major weaknesses. If anything, the slightly pathetic and conventional ending actually fits seamlessly with the previous plot. In this respect, this is perhaps a point of criticism, but merely one without much significance. Otherwise, it's a film that still did a lot to me at 22 years old, even 27 years later. The sensations of pain, shock and happiness regularly catch up with you. Despite its epic running length and slow build, the film is always entertaining and engaging, and it's also beautifully directed and photographed. Hard to find any flaws here."], ["Stephy S", "Jul 27, 2021", 0.8, "Based on the novel written by Stephen King, The Shawshank Redemption is a story about the redemption of humans. The story follows a man named Andy Duphrane who is accused of murdering his wife and the man she had been cheating with and is sent to the Shawshank prison where he becomes friends with another criminal named red. Starring Tim Robbins, Morgan Freeman, John Sandler, and Clancy Brown, the movie has an excellent cast that knows how to deliver a masterpiece. The story is written in a way that makes the audience care about them and their plight. The highlights of this movie are the costume design and setting within the prison. It captures the feel of the prison incredibly well and makes you feel like you're actually in 1947. The score by Thomas Newman is just as wonderful as always as he delivers an emotionally powerful and heart-wrenching soundtrack. The Shawshank Redemption is a wonderful movie that knows where it shines and a brilliant movie that knows exactly how to tug at the heartstrings of the viewer, with phenomenal writing, cinematography and score. This movie knows how to pull off an excellent screenplay. I recommend this movie to anyone who hasn't seen it before, and even if you have, revisit it, you might even notice something you didn't before."], ["kyle c", "Jul 26, 2021", 0.9, "What a satisfying and beautiful film. The story is unique and engaging, with plenty of humor and heart without losing sight of its tragic situation. I love that the movie didn't focus much on Andy trying to prove his innocence - he knew he was innocent, and so did we, and we also both knew there was no point in trying to prove it. Once you're in Shawshank, it doesn't matter who is innocent or guilty, and that's part of what makes this film so powerful. The characters are flawed and grow throughout the movie, and the ones we lose along the way are truly heartbreaking. My only complaint with this one is that we see a 20+ year stretch for all of these characters, yet only the main ones seem to age at all, and even those effects are questionable at best. It took me out of the film occasionally every time I noticed it. But keeping in mind that this is over 30 years old at this point, it's a pretty minor gripe. This film is astounding regardless."], ["Green G", "Jun 28, 2021", 1.0, "What can I say about this that hasn't already been said? An absolute timeless classic. If you haven't seen this, I suggest you stop what you're doing right now and go watch it."], ["dan o", "Jun 17, 2021", 0.9, "Simply a film that's impossible to dislike. The first time i saw it (a long time ago), I felt that it was technically good, but it didn't grip me. On recent subsequent watches, not only does it hold-up, it actually gets better!!!"], ["nic m", "May 27, 2021", 1.0, "Seriously this is Frank Darabont's first movie, hell of a directorial debut. This film is one of the best movies ever made. It is well made, has great acting, and has a great story. The best Frank Darabont movie and the best Stephen King movie, it's a MUST SEE!"], ["Ryan W", "May 18, 2021", 1.0, "One of my favorite movies of all time."], ["Louis S", "May 15, 2021", 1.0, "This is one of the greatest movies ever made. And what canI say, \"salvation lies within\"."], ["Caleb B", "May 8, 2021", 1.0, "A film with one of the most satisfying conclusions ever. One of the best."], ["Robert F", "Apr 7, 2021", 1.0, "Great film about friendship and the inner fortitude that many posses even in the most challenging of situations. Top notch efforts in all aspects of filmmaking; writing, acting, directing and photography. A film that will be a timeless classic for future generations, despite the fact that it wasn't a huge box-office winner."], ["Justin R", "Apr 5, 2021", 1.0, "Fantastic film. It's still special and entertaining everytime I watch it. For those who love the drama genre there is none better than this. It has all the right ingredients - great script, compelling story, interesting characters with strong acting and powerful themes. A true classic."], ["Jason S", "Feb 27, 2021", 1.0, "Definitely one of the 5 best movies of all time. Morgan Freeman delivered the performance of the 90's. Casting was perfect. Hopefully Mr. King can enjoy his work manipulated for the big screen. If you haven't seen in in a theater, mask up and go!"], ["Marshall Spencer", "Jan 31, 2021", 1.0, "First rate acting and compelling plot"], ["jordan m", "Jan 23, 2021", 1.0, "I won't spend a lot of time waxing poetic about the virtues of this movie - everyone knows it's among the greatest of all time. What could one even criticize? The narration was the highlight, followed closely by the screenplay, then the cinematography. Morgan's performance was obviously very good but he's since replicated it in other movies, so it wasn't mindblowing, but still God-tier. The only thing wrong with this movie is that it didn't achieve supreme box office success from word-of-mouth; 1994 was an incredibly strong year for movies."], ["Colin F", "Jan 11, 2021", 1.0, "Beautiful movie with an uplifting story that is believable and magical at the same time. It is a must see with a message of hope."], ["Yonatan M", "Jan 1, 2021", 0.9, "Wonderful movie with great lessons for life and brilliant-written characters."], ["robert d", "Nov 25, 2020", 1.0, "My favorite movie of all time!!"], ["gerald h", "Nov 24, 2020", 1.0, "Favorite movie of all time!"], ["andrea d", "Nov 19, 2020", 1.0, "\"Get busy living, or get busy dying\" It's very reflective that this quote is so central as a theme that it is the basis that guides the actions of each character. Andy never loses hope and he really \"gets busy living\", because he knows that as long as his mind is free and as long as he has still hope, he will never really be a \"prisoner\". The success of the screenplay and the dirctor can be found in having perfectly managed to arouse complete empathy in the viewer towards a prisoner like Red, who has never denied his actions and who, thanks to Andy, has understood that the conditional release will never be what will make him free, but the awareness, of no longer being that man capable of killing other human beings, has led him to be truly free. It's quite a pity that Morgan Freeman didn't get an Oscar or a Golden Globe for his performance, however he had to contend with a Tom Hanks who brought one of his most famous performances to theaters: Forrest Gump. In conclusion, \"Shawshank Redemption\" is a masterpiece that everyone should see at least once in their life; despite its duration, it is very discursive and never heavy. Final grade 10/10"]]]